{
  "work_id": "one-punch-man-season-2",
  "count": 25,
  "characters": [
    {
      "id": "saitama",
      "name": "Saitama",
      "alt_names": [
        "サイタマ",
        "One Punch Man",
        "Bald Cape",
        "Hagemanto (ハゲマント)",
        "Caped Baldy"
      ],
      "role": "protagonist",
      "description": "__Height:__ 175 cm (5'9\")\n\nSaitama is the main protagonist of One Punch Man, and the most powerful hero alive. Having apparently trained himself to superhuman condition, Saitama faces an existential crisis as he is now too powerful to gain any thrill from his heroic deeds.  He is registered with the Heroes Association as a B-Class Superhero and is tasked to defend Z-City against Mysterious Beings. \n\nFor a superhero, Saitama is rather laid-back. Because even the mightiest foes pose no challenge to him, he doesn't take his hero work very seriously. In spite of this, he is constantly searching for an opponent that can challenge him, since his superhero work is beginning to bore him because it's too easy. The combination of his attitude, unstoppable strength, and distinctively simple and 'unimpressive' appearance often cause his battles to become anticlimactic. Saitama will usually allow his opponents to rant about their motives and power up into their strongest forms before suddenly and nonchalantly obliterating them with one punch.",
      "metadata": {
        "gender": "male",
        "age": "25",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b73935-ON5d0mAcrItd.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 73935
      }
    },
    {
      "id": "genos",
      "name": "Genos",
      "alt_names": [
        "ジェノス",
        "Demon Cyborg"
      ],
      "role": "protagonist",
      "description": "__Height:__ 178 cm (5'10\")\n__Debut:__ Chapter 6 / Episode 1\n__Race:__ Cyborg\n__Location:__ Z-City\n__Abilities:__ Enhancements Physical feats, Full Cyborg Weaponry, Highly Skilled and Strategist Combatant\n__Weapons:__ Cyborg Body\n__Occupation:__ Superhero\n__Level:__ S-Class; Rank 16 (beginning), Rank 14 (current)\n__Affiliation:__ The Heroes Association\n\nA cyborg and a self-proclaimed disciple of Saitama. He is always aiming to become stronger and fights for justice.\n\nGenos is an extremely serious character. He has a strong motivation to become stronger and is always looking at Saitama as an example of the ultimate hero. Constantly trying to be like him even if it results in reckless fights.",
      "metadata": {
        "gender": "male",
        "age": "19",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b73979-tVi9maPID881.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 73979
      }
    },
    {
      "id": "garou",
      "name": "Garou",
      "alt_names": [
        "ガロウ",
        "Garo",
        "Human Monster",
        "Hero Hunter",
        "Wolf Man"
      ],
      "role": "protagonist",
      "description": "__Height:__ 177 cm (5'9\")\n\nGarou is a former disciple of Bang, but was kicked out from his dojo for going on a rampage. He's one of the strongest characters in the series and plays a major role as the main villain in the Hero Hunt arc.\n\nGarou is introduced as an evil character with a hatred for heroes and a confident, vindictive personality. He hates being insulted and will attack or kill any who offend him. He thinks highly of himself and uses that assertion to threaten high ranking personal such as heroes and Shicchi. He does not consider other human villains to be allies, wiping out a large group of them along with the heroes present. He will also attack low ranked hero and hero staff members if he encounters them. A large aspect of his personality seems to be some sort of disdain for his former master, Bang, enough to avoid using the Water Stream Rock Smashing Fist he was taught unless seriously cornered.\n\nHe has no remorse even for people who aid him, as he smashed Licenseless Rider's face soon after the latter defended him.\n\nAlthough Garou is an evil character, he possesses some kind of morality: he lets heroes live so that they can grow stronger and fight him again.\n\nIn some ways, Garou can be considered the opposite to Saitama. Where Saitama wanted to be a hero who fought villains from his childhood, Garou wanted to be a monster who defeated heroes. While Garou is a genius fighter, Saitama had to work extremely hard to get his strength.",
      "metadata": {
        "gender": "male",
        "age": "18",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b89277-xBGb4B5YISXg.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 89277
      }
    },
    {
      "id": "king",
      "name": "King",
      "alt_names": [
        "キング",
        "The Strongest Man on Earth"
      ],
      "role": "supporting",
      "description": "__Race:__ Human  __Occupation:__ Superhero \n__Level:__ S-Class; Rank 7\n__Affiliation:__ The Heroes Association\n\nDespite not being the highest ranked hero of the Heroes Association, he is considered to be the most powerful man on Earth, and it is due to this strength that he receives praise and respect from fellow heroes. His strength is so feared that criminals and mysterious beings will surrender before having to fight him. Appearance: King has slightly long, blonde, brushed back hair along with three long scars on the left side of his face. He wears a turtleneck sweater, has sunken cheeks, a defined jawline and a squarish chin. Notably, a loud drumming sound may be heard in his proximity. The King Engine is a rumbling sound that others claim occurs when King readies for battle or when he is generally serious having an intimidating effect on his opponents. ~! In actuality, it is simply the sound of King's heartbeat which, when he is frightened, is so loud that it can be heard outside his body, but because of King's intimidating reputation people mistake it for bloodlust. King is able to appear to remain calm in threatening situations as well as put out an extremely threatening aura. Despite the intimidating personality King projects, he is actually a coward and an otaku. He has been shown to get very excited about buying a dating game. Saitama saved his life many times, but always end up getting all the credits that was supposed to be for the latter. With this misunderstanding, he came to be known as \"the strongest man on earth\". He got his scars from the Octopus Claw man. !~",
      "metadata": {
        "gender": "male",
        "age": "29",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/n88907-M7QLjYvp2LEp.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 88907
      }
    },
    {
      "id": "butagami",
      "name": "Butagami",
      "alt_names": [
        "豚神",
        "Pig God"
      ],
      "role": "supporting",
      "description": "__Race:__ Human\n__Occupation:__ Superhero\n__Abilities:__ Superhuman Physical Prowess, Inhuman Digestive System, Elasticity\n__Level:__ S-Class: Rank 10\n\n__Personality:__ \nPig God is a glutton and is constantly eating food. He is also very direct, or simply lazy. However he is a very caring individual and also appears to be very humble, as he usually doesn't mind helping others or openly embracing other heroes' advices. He also does not mind paying for people in secret. \n\n__Abilities:__\n As an S-Class hero, Pig God is very powerful, he has the ability to digest swallowed monsters almost instantly, he also seems to have complete control over his digestive system. Pig God has a thick layer of fat capable of absorbing all types of impact and he is also immune to poison.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b8841-sm1m2mVez5IE.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 8841
      }
    },
    {
      "id": "kuseno-hakase",
      "name": "Kuseno-hakase",
      "alt_names": [
        "クセーノ博士",
        " Doctor Kuseno "
      ],
      "role": "supporting",
      "description": "The doctor responsible for Genos' repairs and upgrades. He was pursing the cyborg that destroyed Genos' town. Genos begged for him to make him into a cyborg after promising the destroy the cyborg that destroyed his home.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b13124-AjG67JtCz0bK.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 13124
      }
    },
    {
      "id": "onsoku-no-sonic",
      "name": "Onsoku no Sonic",
      "alt_names": [
        "音速のソニック",
        "Speed of Sound",
        "Speed-o'-Sound",
        "Sonic",
        "Jack-o'-lantern Panic"
      ],
      "role": "supporting",
      "description": "__Height:__ 174 cm\n__Race:__ Human\n__Location:__ Z-City\n__Abilities:__ Superhuman Speed and Agility\n__Weapons:__ Ninja equipment\n__Occupation:__ Bodyguard (former, now a villain)\n__Affiliation:__ Mr. Monier (former)\n\nSonic is a villain in the series, first appearing as a bodyguard hired by Mr. Monier. He views Saitama as his eternal rival.\n\nSonic is a villain who, despite his normally calm appearance, loves fighting strong opponents as shown by when he gets a \"child-like smile\" on his face when he first meets Saitama and has two of his attacks blocked, earlier calling this his \"bad habit.\" He seems to be very quick to act as he attacks Saitama on their first meeting without letting him explain the situation.",
      "metadata": {
        "gender": "male",
        "age": "25",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b74167-FE8EtGtHUM77.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 74167
      }
    },
    {
      "id": "sneck",
      "name": "Sneck",
      "alt_names": [
        "スネック",
        "Biting Snake Fist"
      ],
      "role": "supporting",
      "description": "__Race:__ Human \n__Occupation:__ Superhero \n__Level:__ A-Class; Rank: 38\n__Affiliation:__ Heroes Association \n\nSneck is an A-Class Superhero, rank 38. He was tasked with welcoming the new heroes for the National Superhero Registry Test that Saitama and Genos were a part of.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b75460-ytg6vTtJNGOw.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 75460
      }
    },
    {
      "id": "bang",
      "name": "Bang ",
      "alt_names": [
        "バング",
        "Silver Fang",
        "シルバーファング"
      ],
      "role": "supporting",
      "description": "__Height:__ 165 cm (5'5\")\n__Race:__ Human  \n__Occupation:__ Superhero \n__Level:__ S-Class \n__Rank:__ 3 \n__Affiliation:__ Heroes Association\n\n Bang is an S-Class, rank 3, superhero for the Heroes Association, settled in Z-City. Bang owns a dojo passed down from generations, and uses the fighting style the Rock-Smashing Water Stream Fist.   \n\n__Abilities:__ Bang being in the top 3 of the S-Class ranking, he is acknowledged by the public and heroes to be a strong fighter. Not much is known about Bang's abilities other than that he uses a martial art called \"Rock-Smashing Water Stream Fist\".",
      "metadata": {
        "gender": "male",
        "age": "81",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/n81141-1ml7Q6X2B508.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 81141
      }
    },
    {
      "id": "tatsumaki",
      "name": "Tatsumaki",
      "alt_names": [
        "タツマキ",
        "Terrible Tornado"
      ],
      "role": "supporting",
      "description": "__Race:__ Human\n__Abilities:__ Psychokinesis\n__Occupation:__ Superhero\n__Level:__ S-Class; Rank: 2\n__Affiliation:__ Heroes Association\n__Family:__ [Fubuki](https://anilist.co/character/81931/) (sister)\n\nTatsumaki is a petite woman, commonly mistaken for being much younger than she really is, she has an adolescent face with emerald green eyes and green hair that naturally curls up on the ends. She wears a long dress that separates into 4 sections slightly above the hips and low-heeled black shoes.\n\n__Personality:__\nShe has a rather brash, moody, hotheaded, and impatient personality. She is disrespectful towards most people, especially to those she deems incompetent. Despite her arrogant personality, she feels obligated to defeat monsters and considers her job as a hero to be a duty, accepting any of the Hero Association's requests to defeat monsters, due to the fact that she tends to get bored when she is not fighting monsters, she also seeks them to fight in her own time. She has a bit of a soft side towards her little sister Fubuki, but she is also very overprotective.\n\n__Abilities:__\nAs the most powerful esper in One-Punch Man and one of the most powerful heroes, Tatsumaki possesses extreme skill in wielding her psychic abilities, whether it be for offense, defense, or miscellaneous uses. Tatsumaki's knowledge about psychic powers is also as vast as her skill in wielding them, as much to lift an entire city. She's also called as the Association's ultimate weapon.",
      "metadata": {
        "gender": "female",
        "age": "28",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b81929-WPVp2LQoWgkc.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 81929
      }
    },
    {
      "id": "fubuki",
      "name": "Fubuki",
      "alt_names": [
        "フブキ",
        "Hellish Blizzard",
        "Jigoku no Fubuki (地獄のフブキ)"
      ],
      "role": "supporting",
      "description": "__Race:__ Human\n__Occupation:__ Superhero\n__Height:__ 167 cm (5'5¾\")\n__Level:__ B-Class Rank 1\n__Affiliation:__ Hero Association\n__Family:__ Tatsumaki (sister)\n__Abilities:__ Psychokinesis\n\nFubuki, also known by her hero alias Blizzard of Hell, is the B-Class Rank 1 professional hero of the Hero Association. She is an esper, the younger sister of Tatsumaki, and the leader of the Blizzard Group, a B-Class hero faction. She and her sister are known as the Psychic Sisters. Fubuki is currently trying to recruit Saitama into her group. She's also a self-declared member of the Saitama Group.",
      "metadata": {
        "gender": "female",
        "age": "23",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b81931-fmouMoprPVbV.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 81931
      }
    },
    {
      "id": "bofoi",
      "name": "Bofoi",
      "alt_names": [
        "ボフォイ",
        "Metal Knight (メタルナイト)",
        "Bofoi Hakase (ボフォイ博士)",
        "Dr. Bofoi"
      ],
      "role": "supporting",
      "description": "__Race:__ Human \n__Alias:__ Metal Knight  \n__Location:__ Z-City \n__Abilities:__ Weapons; Large remotely controlled robot, with lots of firepower \n__Occupation:__ Superhero \n__Level:__ S-Class; Rank: 6 \n__Affiliation:__ The Heroes Association  \n\nS-Class Rank 6 of the Hero Association. Besides fighting, Bofoi also provides many services for the Hero Association, such as weaponry sponsorships and facility construction.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/81933.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 81933
      }
    },
    {
      "id": "satoru",
      "name": "Satoru",
      "alt_names": [
        "サトル",
        "Mumen Rider (無免ライダー)",
        "License-less Rider"
      ],
      "role": "supporting",
      "description": "__Race:__ Human\n__Location:__ Z-City\n__Weapons:__ Gauntlets\n__Occupation:__ Superhero\n__Level:__ C-Class; Rank: 1\n__Affiliation:__ Heroes Association\n\nLicense-less Rider is a C-Class Hero from Z-City. He has the #1 rank of the C-Class.",
      "metadata": {
        "gender": "male",
        "age": "Unknown",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b81935-NGDgB9J4MMlF.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 81935
      }
    },
    {
      "id": "tanktop-tiger",
      "name": "Tanktop Tiger",
      "alt_names": [
        "タンクトップタイガー "
      ],
      "role": "supporting",
      "description": "**Race:** Human  \n**Occupation:** Superhero \n**Level:** C-Class; Rank: 6 \n**Affiliation:** The Heroes Association \n\nTanktop Tiger (タンクトップタイガー Tankutopu Taiga) is a C-Class superhero, rank 6, and the younger brother of Tanktop Black Hole.   __Appearance:__ Tanktop Tiger is a large, muscular man who has tiger stripes running through his hair and eyebrows. He wears a tiger stripped tanktop. Tanktop Tiger is especially loud and obnoxious. He is confident in his own power and looks down upon superhero newbies, making him quite arrogant and hostile.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b81939-O5EORVRLJKne.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 81939
      }
    },
    {
      "id": "tanktop-black-hole",
      "name": "Tanktop Black Hole",
      "alt_names": [
        "タンクトップブラックホール"
      ],
      "role": "supporting",
      "description": "__Race:__ Human \n__Alias:__ Tanktop Black Hole  \n__Occupation:__ Superhero \n__Level:__ B-Class \n__Affiliation:__ The Heroes Association \n__Partner:__ Tanktop Tiger \n\nTanktop Black Hole is a B-Class hero and the older brother of Tanktop Tiger. Tanktop Black Hole is a large, well-built man with short black hair. He wears a very simple costume of pants and a black tanktop. He has a rather confident and stubborn personality. He refuses to believe a C-Class hero could ever be capable of destroying the meteor. He is also a rather charismatic person, shown by his ability to bend a crowd to his will.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b81941-RcCOvo4G42mY.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 81941
      }
    },
    {
      "id": "ougon-ball",
      "name": "Ougon Ball",
      "alt_names": [
        "黄金ボール",
        "Golden Ball"
      ],
      "role": "supporting",
      "description": "__Race:__  Human  \n__Weapons:__ Slingshot\n__Abilities:__ Shape Memory Gold \n__Occupation:__  Superhero \n__Level:__  A-Class; Rank: 29 \n__Affiliation:__  Heroes Association \n\nGolden Ball is an A-Class Superhero, rank 29. He was partnered with Spring Mustache to investigate the Kombu Infinity rumor in Z-City.  He is a rather confident man, who believes he does not need to prepare for a fight.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b81943-Zbjr1W8O0lkl.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 81943
      }
    },
    {
      "id": "armored-gorilla",
      "name": "Armored Gorilla",
      "alt_names": [
        "アーマードゴリラ",
        "The Crystal of Wisdom",
        "英知ノ結晶",
        "アーマード ゴリラ"
      ],
      "role": "supporting",
      "description": "",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b85983-IRPD9S7HaP7x.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 85983
      }
    },
    {
      "id": "banken-man",
      "name": "Banken Man",
      "alt_names": [
        "番犬マン",
        "Watchdog Man"
      ],
      "role": "supporting",
      "description": "Watchdog Man (番犬マン Banken-man) is a S-Class Rank 12 professional hero who is in charge of Q-City. Watchdog Man has been shown to be very blunt and nonchalant. He acts like a dog at all times, speaking sparingly, sitting on his haunches while alert or loitering, and curling up in a dog bed while asleep. He takes a stance on all fours while fighting, rather than standing upright to confront enemies.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b86027-g3kRrv9jewmz.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 86027
      }
    },
    {
      "id": "puri-puri-prisoner",
      "name": "Puri-Puri Prisoner",
      "alt_names": [
        "ぷりぷりプリズナー",
        "Pretty Pretty Prisoner",
        "Puri-Puri Purisoner"
      ],
      "role": "supporting",
      "description": "__Occupation:__ Superhero \n__Level:__ S-Class; Rank 17\n\nPuri-Puri Prisoner is a flamboyant, openly homosexual superhero. He takes an interest in other, up-and-coming heroes and criminals; an interest which led to his titular jail sentence, as he kept attacking them. Criminals that he apprehends are then added to his harem.",
      "metadata": {
        "gender": "male",
        "age": "33",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/n86029-iomUtQtGfJOU.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 86029
      }
    },
    {
      "id": "ikemen-kamen-amai-mask",
      "name": "Ikemen Kamen Amai Mask",
      "alt_names": [
        "イケメン仮面アマイマスク",
        "Handsome Kamen Amai Mask",
        "Handsomely Masked Sweet Mask"
      ],
      "role": "supporting",
      "description": "__Race:__ Human\n~!Mysterious Being (Ugmon)!~\n__Occupation:__ Superhero\n__Level:__ A-Class; Rank 1.  \n\n Sweet Mask is a tall and lean-built young man with messy, shoulder-length light blue hair and yellow eyes. He is considered to be very handsome by the public. Aside from being a hero he is also a famous model, actor and singer, being the most popular one in the world. Sweet Mask has stated that he believes that heroes are to protect the citizens, and if they can't do that, they must become strong enough to be able to do so. He also genuinely cares for the well-being of the citizens around him and actually wishes happiness upon every living thing in the universe. However, befitting the darker side of Sweet Mask's name is his hidden merciless nature. He is shown to have a burning hatred for anything that he sees as evil. Anything that he declares as evil must be swiftly and thoroughly exterminated. \n\nSweet Mask is shown to adhere to any method that makes heroes popular. He notes that only promotions to S-Class or A-Class are fit for his attention, as they are the heroes who draw the most attention from the public, and hence, any heroes in those ranks who earn themselves negative reputations would drag his reputation down as well. Because of this, Sweet Mask stays in the A-Class Rank 1 position to prevent unworthy heroes from promoting to S-Class. \n\nSweet Mask is very narcissistic about \"beauty overwhelming the power\", as he said about his philosophy that \"heroes have to be beautiful as well\". This became obvious when he showed interest in a worthy S-Class Hero like Genos, who has both a beautiful appeal and having done more heroic deeds as the main priority, fitting Sweet Mask's philosophy. \n\n~! However, after witnessing the defeat of Garou by Saitama, his viewpoint changes and becomes more focused on the overwhelming power of the individual than beauty alone. !~",
      "metadata": {
        "gender": "male",
        "age": "24",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b86031-7NpSkSSrT7ZJ.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 86031
      }
    },
    {
      "id": "max",
      "name": "Max",
      "alt_names": [
        "マックス",
        "Lightning Max",
        "Inazumax (イナズマックス)"
      ],
      "role": "supporting",
      "description": "Max (マックス, Makkusu), also known by his hero alias Lightning Max (イナズマックス, Inazumakkusu), is the A-Class Rank 19 professional hero for the Hero Association. Max is shown to think ahead and spy on his target to know how to defeat them but it is shown that he has some doubt in his abilities.",
      "metadata": {
        "gender": "male",
        "age": "21",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b86035-7qVYP8GdGirt.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 86035
      }
    },
    {
      "id": "banehige",
      "name": "Banehige",
      "alt_names": [
        "バネヒゲ",
        "Spring Mustachio"
      ],
      "role": "supporting",
      "description": "__Level:__ A-Class; Rank: 33\n\nSpring Mustachio is an intelligent, serious man who doesn't back down, as shown by his persistence in fighting Kombu Infinity, even after being beaten up rather badly. He also shares a bond with fellow A-Class hero Golden Ball, as they regularly pair up to hunt monsters and share drinks in their spare time.",
      "metadata": {
        "gender": "male",
        "age": "47",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b86039-W1oBy3Ma0yuk.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 86039
      }
    },
    {
      "id": "genji",
      "name": "Genji",
      "alt_names": [
        "ゲンジ",
        "Raikou Genji (電光ゲンジ)",
        "Lightning Genji"
      ],
      "role": "supporting",
      "description": "__Height:__ 165cm\n\nGenji, also known by his hero alias Lightning Genji, is the A-Class Rank 17 professional hero of the Hero Association.",
      "metadata": {
        "gender": "male",
        "age": "24",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b86043-7QU7rj3aDYD9.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 86043
      }
    },
    {
      "id": "bad",
      "name": "Bad",
      "alt_names": [
        "バッド",
        "Kinzoku Bat (金属バット)",
        "Metal Bat"
      ],
      "role": "supporting",
      "description": "Bad (バッド, Baddo), also known by his hero alias Metal Bat (金属バット, Kinzoku Batto), is the S-Class Rank 15 professional hero for the Hero Association. Metal Bat is a young man with black hair styled in a pompadour, and dark eyes that emphasize his hot temper. Metal Bat has a great deal of confidence in himself, stating that he did not care whether a threat is a Demon or Dragon level. Like Saitama, he doesn't care about his rank, and accidentally kills his enemies faster than he intended.",
      "metadata": {
        "gender": "male",
        "age": "17",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b89156-kGKJyhWnCTHy.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 89156
      }
    },
    {
      "id": "kuroi-seishi",
      "name": "Kuroi Seishi",
      "alt_names": [
        "黒い精子",
        "Black Sperm",
        "Black Spermatozoon"
      ],
      "role": "supporting",
      "description": "Black Sperm is an arrogant yet insecure monster. He is very confident in his abilities, shown in his willingness to take on Monster King [Orochi](https://anilist.co/character/126979/Orochi), but he dislikes when other people \"look down on him\" for his appearance or personality, and if he senses that someone is doing so, he becomes furious. At the same time, he is willing to work with others in order to take on a stronger opponent, shown by his cooperation with the Monster Association.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b126976-vjLxpJVJ4QTW.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 126976
      }
    }
  ],
  "updated_at": "2025-12-22T13:34:17.099Z"
}