{
  "work_id": "attack-on-titan",
  "count": 25,
  "characters": [
    {
      "id": "mikasa-ackerman",
      "name": "Mikasa Ackerman",
      "alt_names": [
        "ミカサ・アッカーマン"
      ],
      "role": "protagonist",
      "description": "__Height:__ 170 cm (5'7\") - 176 cm (5'9½\")\n__Position:__ 104th Training Corps, Survey Corps\n__Relatives:__ [Birth Mother](https://anilist.co/character/84341/Mikasa-no-Haha) (Deceased), [Birth Father](https://anilist.co/character/84339/Mikasa-no-Chichi) (Deceased), [Grisha Yaeger](https://anilist.co/character/62477/Grisha-Yeager) (Foster Father), [Carla Yaeger](https://anilist.co/character/62475/Carla-Yeager) (Foster Mother, Deceased), [Eren Yeager](https://anilist.co/character/40882/Eren-Yeager) (Foster Brother)\n\nMikasa is Eren Yaeger's foster sister and mutual childhood friend of [Armin Arlert](https://anilist.co/character/46494), living with the two of them in Shiganshina District within the southern region of Wall Maria. \n\nWhen she was young, her parents were killed by human traffickers, and she was kidnapped. Eren discovered this and helped her escape her captors. Later, Eren gave her his scarf, which she constantly wears and shares an emotional attachment to. She was adopted by the Yaeger family soon after. Because of these past events, Mikasa shares an unbreakable bond with Eren and lives to protect him, constantly worrying for Eren's well-being. After the Titans broke through Wall Maria and killed her and Eren's mother, she chose to follow Eren into the military to try and keep him safe from danger. \n\nEven as a child, Mikasa possessed impressive fighting skill and strength, and that skill was only honed further during her training.  Mikasa is considered a genius among all the army trainees and is incredibly skilled at combat and agility, to the point that she was known as the greatest soldier among the 104th Training Corps and graduated in first place. Though being among the best of the best, she remains humble and refrains from displaying arrogance. Ultimately, Mikasa's loyalty remains with Eren no matter the circumstance, with her only true desire being to live a peaceful life with him.",
      "metadata": {
        "gender": "female",
        "age": "15-",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b40881-F3gr1PkreDvj.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 40881
      }
    },
    {
      "id": "eren-yeager",
      "name": "Eren Yeager",
      "alt_names": [
        "エレン・イェーガー",
        "Eren Jaeger",
        "Eren Jäger",
        "Suicidal Maniac",
        "Shi ni Isogi Yarou (死に急ぎ野郎)"
      ],
      "role": "protagonist",
      "description": "__Initial Height__: 170 cm (5'7\")\n__Affiliation:__ 104th Trainees Squad, Survey Corps. \n\nEren was born to Carla and Grisha Yeager in Shiganshina District within the southern region of Wall Maria. He grew up in the town with his parents and foster sister [Mikasa](https://anilist.co/character/40881), who moved in with the Yeagers as a child. Eren spent most of his time with Mikasa and their mutual best friend [Armin Arlert](https://anilist.co/character/46494), whom the pair often defended from neighborhood bullies.  \n\nEren is a passionate, determined, hardheaded, and impulsive young man. When they were children, Armin showed him a book depicting the wonders of the outside world. Eren grew to share Armin's curiosity of the world beyond the Walls and resolved to see it for himself. This dream inspired his admiration of the Survey Corps and his desire to join their ranks as soon as he became eligible for enrollment. \n\nWhen the Titans suddenly broke through Wall Maria into Shiganshina, Eren was forced to watch on as his mother became trapped under the rubble of their house and eaten by a titan. Forever changed from this event, Eren vows to kill every last titan.",
      "metadata": {
        "gender": "male",
        "age": "15-",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b40882-dsj7IP943WFF.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 40882
      }
    },
    {
      "id": "levi",
      "name": "Levi",
      "alt_names": [
        "リヴァイ",
        "Levi Heichou (リヴァイ兵長)",
        "Captain Levi",
        "Jinrui Saikyou no Heishi (人類最強の兵士)",
        "Humanity's Strongest Soldier",
        "Heishichou (兵士長)"
      ],
      "role": "protagonist",
      "description": "__Height:__ 160 cm (5'3\")\n\nSquad Captain of the Special Operations Squad (known as Squad Levi) within the Survey Corps. He is known as humanity's strongest soldier. \n\nLevi is abrasive, blunt, and has a strong respect for structure and discipline. He is a clean-freak, demanding spotless cleanliness of himself, his equipment, and his environment. Rumors say he was involved in underground crime in his life before coming a soldier. Despite his emotionless and unfriendly demeanor, Levi cares deeply for his squad and greatly values human life.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b45627-CR68RyZmddGG.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 45627
      }
    },
    {
      "id": "armin-arlert",
      "name": "Armin Arlert",
      "alt_names": [
        "アルミン・アルレルト",
        "Armin Arlelt"
      ],
      "role": "protagonist",
      "description": "__Height:__ 163 cm (5'4\")\n__Position:__ 104th Trainees Squad, Survey Corps\n__Relatives:__ [Grandfather](https://anilist.co/character/84313/Armin-no-Ojiisan)\n\nArmin is a young boy who was born and raised in the Shiganshina District within the walls, being childhood friends with both [Eren Yeager](https://anilist.co/character/40882/Eren-Yeager) and [Mikasa Ackerman](https://anilist.co/character/40881). After Wall Maria was breached, he chose to join Mikasa and Eren in joining the military, both to try to make a good and meaningful impact on the world, and to fulfill his dream of seeing the outside world.\n\nEven when he was young, the naturally curious Armin has always had a deep fascination with the world beyond the Walls. As a child, he found and studied an illegal book about the outside world that was owned by his grandfather. He often shared the book and information contained in it with Eren Yeager, his best friend, and his dreams of seeing the world outside the walls. Armin was branded a heretic by other children for his unusual interest in the outside world and was thus frequently picked on. Too timid to defend himself, Armin would often rely on his friends Eren and Mikasa Ackerman to protect him from local bullies. This, coupled with his frail physique, was a deep shame for Armin, leading him to have poor self-esteem and to believe that he is a burden to others. Because of this, Armin has always been very eager to prove his worth, especially towards his close friends. \n\nArmin is known to be exceptionally loyal and selfless. He constantly worries for the safety of his friends, and he is always prepared to throw himself into dangerous situations to save them. Alongside his kindhearted nature and emotionally intelligence, Armin is a very analytical person. He likes to think deeply about situations and solve problems using his mind. These personality traits, in conjunction with his intelligence, good judgment, level headedness, ability to plan ahead, come up with creative ideas and to think outside the box, are what make him a great tactician. Although he may appear among the physically weakest of the 104th Training Corps, his incredible intelligence and strategic genius makes him an invaluable asset to any team.",
      "metadata": {
        "gender": "male",
        "age": "15-",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b46494-g7xYYuBtYPnO.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 46494
      }
    },
    {
      "id": "sasha-blouse",
      "name": "Sasha Blouse",
      "alt_names": [
        "サシャ・ブラウス",
        "Sasha Braus",
        "Imo Onna (芋女)",
        "Potato Girl"
      ],
      "role": "supporting",
      "description": "__Initial Height:__ 168cm\n__Affiliations__: 104th Cadet Corps, Survey Corps; Soldier\n__Relatives__: [Artur Blouse](https://anilist.co/character/131281/Artur-Blouse) (Father), [Lisa Blouse](https://anilist.co/character/134952/Lisa-Blouse) (Mother)\n\nOriginally from Dauper, a remote and scarcely populated village of hunters located in a mountain forest in the southern area of Wall Rose, Sasha joined the military as a cadet of the 104th Training Corps, where she ranked 9th upon graduation. After graduating, she'd choose to enlist in the Scouting Regiment. \n\nSasha is a friendly and fun-loving girl. She speaks with a local accent from her home village, but initially hid it out of embarrassment by using overly formal and polite speech. She is a constant food hoarder and is known to have an incredible appetite; eating provided her with considerable gratification and relief, especially during times of great stress, and food was often the only thing on her mind when at ease. Raised as an animal hunter, Sasha specializes in archery, horseback riding, and tracking, although her eccentricity and unconventional methods tend to make her a poor fit for group operations.\n\n~!She later saves a child named [Kaya](https://anilist.co/character/132738/Kaya) from a titan attack, who her family ends up adopting.!~",
      "metadata": {
        "gender": "female",
        "age": "16-",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b45887-QPtJH0KwqthW.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 45887
      }
    },
    {
      "id": "reiner-braun",
      "name": "Reiner Braun",
      "alt_names": [
        "ライナー・ブラウン"
      ],
      "role": "supporting",
      "description": "__Height__: 185 cm (6'1\")\n\nMember of the Survey Corps and former cadet of the 104th Training Corps. Reiner is a passionate and strong-willed young man with a strong sense of duty. He ranked 2nd in his training class upon graduation, finishing behind only [Mikasa](https://anilist.co/character/40881). His comrades have great trust in him, and he is stated to be the \"big brother\" of the 104th cadets.",
      "metadata": {
        "gender": "male",
        "age": "17-",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b46484-P6A2GjNQn49F.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 46484
      }
    },
    {
      "id": "connie-springer",
      "name": "Connie Springer",
      "alt_names": [
        "コニー・スプリンガー",
        "Conny"
      ],
      "role": "supporting",
      "description": "__Height__: 158 cm (5'2\")  \n__Relatives:__ [Mother](https://anilist.co/character/137287/Conny-no-Haha), Martin Springer (Brother), Sunny Springer (Sister)\n\nConnie Springer is a graduate of the 104th Training Corps, having ranked 8th in class. He is known to be one of the quickest soldiers while using ODM gear and is skilled at making very sharp turns. He hails from the rural Ragako Village within Wall Rose, his greatest ambition being to make his family and village proud of him. Upon graduation, he chose to join the Survey Corps. \n\nUpbeat and naive, Connie is rather unfocused outside of combat, and enjoys goofing around and messing with his friends, but can also be a bit dense at times, as he can have some difficulty comprehending new developments as they appear. Connie always tries to remain optimistic, consistently caring for the well-being of his friends, family and village, and being willing to help in any way he can. However, this soft spot and the struggles he goes through as a member of the Survey Corps takes a toll on him, as he often responds to grief and loss with anger, irritation and hatred, causing him to at times make rash, impulsive decisions. He will do anything to protect his family, whether it be his biological family or his closest friends.",
      "metadata": {
        "gender": "male",
        "age": "15-",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/n46486-izhPjzut6WCZ.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 46486
      }
    },
    {
      "id": "bertolt-hoover",
      "name": "Bertolt Hoover",
      "alt_names": [
        "ベルトルト・フーバー",
        "Bertholdt"
      ],
      "role": "supporting",
      "description": "__Height__: 192 cm (6'3\")  \n__Affiliation__: Survey Corps\n\nMember of the Survey Corps and former cadet of the 104th Training Corps. Bertoldt ranked 3rd in his training class upon graduation, finishing behind only [Mikasa](https://anilist.co/character/40881) and his hometown friend [Reiner](https://anilist.co/character/46484). He is a quiet young man who identifies himself as someone with a weak will that follows popular opinion. Despite ranking 3rd in his class, his training commandant noted him to be a person with great potential, but an utter lack of initiative. Bertoldt originally he enlisted in the military with aspirations of joining the Military Police and living in the safety of the inner wall, but after the Battle of Trost he instead decided to join the Survey Corps.",
      "metadata": {
        "gender": "male",
        "age": "16-",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b46488-wm6HvkdkHoZu.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 46488
      }
    },
    {
      "id": "annie-leonhart",
      "name": "Annie Leonhart",
      "alt_names": [
        "アニ・レオンハート"
      ],
      "role": "supporting",
      "description": "__Height__: 153 cm (5\")  \n\nA member of the 104th Southern Division in the Cadet Corps. After graduating from the 104th, ranked 4th place in the top 10, she ends up joining the Military Police. She is roommates with [Hitch Dreyse](https://anilist.co/character/86017).\n\nA stoic girl, Annie is considered to be an isolated, solitary type, being rarely seen smiling or socializing and often having an emotionless expression. She is apathetic and somnolent, with little desire to put in any effort into meaningless disciplines or activities. Nonetheless, what drives Annie more than anything is her desire for a normal life.",
      "metadata": {
        "gender": "female",
        "age": "16-",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b46490-tan274Ifc1Jf.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 46490
      }
    },
    {
      "id": "hannes",
      "name": "Hannes",
      "alt_names": [
        "ハンネス"
      ],
      "role": "supporting",
      "description": "A soldier who saves Eren and Mikasa during the prologue. He owes a debt to the Yeager family.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b46492-5kRaMLDCVD0B.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 46492
      }
    },
    {
      "id": "erwin-smith",
      "name": "Erwin Smith",
      "alt_names": [
        "エルヴィン・スミス",
        "Eyebrow"
      ],
      "role": "supporting",
      "description": "**Height:** 188 cm\n**Position:** 13th Commander, Survey Corps\n\nDiscerning, intelligent, and widely respected, Erwin is the unshakable and calculated 13th commander of the Survey Corps. While he cares deeply for his men, he does not hesitate to sacrifice them for the good and prosperity of mankind, and his men have proven more than willing to stake their lives at his order. Erwin developed the Long-Distance Enemy Scouting Formation.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b46496-Mu86MENd5wNB.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 46496
      }
    },
    {
      "id": "jean-kirstein",
      "name": "Jean Kirstein",
      "alt_names": [
        "ジャン・キルシュタイン",
        "Jean Kirschtein",
        "Jeanie",
        "Horse Face"
      ],
      "role": "supporting",
      "description": "__Height__: 175 cm (5'8\")\n__Relatives__: [Mother](https://anilist.co/character/131444/Jean-no-Haha)\n\nJean Kirschtein is a graduate of the 104th Cadet Corps, among whom he ranked 6th for his skills with ODM gear and ability to look at things through a more tactical lense. Jean hails from Wall Rose's Trost District, and joined the military with hopes of living a peaceful life within the walls as part of the Military Police. However, he would later find himself joining the Survey Corps after being convinced both by his close friend [Marco Bott's](https://anilist.co/character/62479/Marco-Bott) words, and after witnessing the death of several of his comrades.\n\nJean has a blunt personality. He holds no restraint when it comes to speaking his mind, even when he knows it would not be wise to do so or when it could spark conflict. Jean is also pragmatic: he has a strong aversion to exposing himself to dangerous situations. During his time as a cadet, Jean was extremely hot-headed, easily becoming frustrated and quick to resort to violence when pushed. Jean was also very cynical about defeating the Titans, believing that humanity has no chance against them and openly mocking more idealistic individuals like [Eren Yeager](https://anilist.co/character/40882/Eren-Yeager), and saw resisting the Titans as a hopeless cause. However, despite these things, and although he presents himself as self-centered, Jean places high value on the lives of his comrades, and is willing to risk his life to prevent countless more deaths from his comrades. Even with his shortcomings, Jean has shown himself to be a natural leader, being able to understand others and assess situations well because of his flaws, and proves capable of leading his fellow soldiers when they are left confused and without a plan.",
      "metadata": {
        "gender": "male",
        "age": "16-",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b46498-ritqAj9FW6jX.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 46498
      }
    },
    {
      "id": "carla-yeager",
      "name": "Carla Yeager",
      "alt_names": [
        "カルラ・イェーガー"
      ],
      "role": "supporting",
      "description": "Eren's mother.   ~!She's eaten alive in the second chapter.!~ Note: Carla Yeager is the official English translation by Kodansha.",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/n62475-CExspVnLfweu.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 62475
      }
    },
    {
      "id": "grisha-yeager",
      "name": "Grisha Yeager",
      "alt_names": [
        "グリシャ・イェーガー",
        "Grisha Jaeger"
      ],
      "role": "supporting",
      "description": "Father of [Eren Yaeger](https://anilist.co/character/40882/Eren-Yeager) and caretaker of [Mikasa Ackerman](https://anilist.co/character/40881/Mikasa-Ackerman). He is a renowned doctor who was well respected in the District of Shiganshina after he saved the village from a mysterious viral epidemic by developing vaccines. He also provides a medical house call service to the people of Shiganshina and to various towns in addition to having a network of contacts within the Corps of the Shiganshina District. He is married to [Carla Yaeger](https://anilist.co/character/62475).\n\n~!In the basement of the Yeager family house, he hides a secret which he refers to as the \"truth\". Upon finding Eren after the fall of Wall Maria, he injects him with a series of chemicals and amnesiacs and entrusts him with the key to the \"truth\", before mysteriously disappearing. This strange serum resulted in Eren gaining the ability to transform into a titan.!~",
      "metadata": {
        "gender": "male",
        "age": "39",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b62477-3AHBGul9bXK8.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 62477
      }
    },
    {
      "id": "marco-bott",
      "name": "Marco Bott",
      "alt_names": [
        "マルコ・ボット",
        "Marco Bodt"
      ],
      "role": "supporting",
      "description": "__Height__: 178 cm (5'9\")\n__Affiliations__: 104th Training Corps\n\nOriginally from Jinae District. Marco ranked 7th in the 104th Training Corps and is widely respected by other cadets of the 104th. Marco is a very kind, calm, and idealistic person, valuing the good of the group above his own interests, as well as understanding and coping with his own shortcomings and limitations. He is seen as a natural leader, and desires to join the Military Police to serve near the King. \n\n*Note: Marco Bott is the official English translation by Kodansha.*",
      "metadata": {
        "gender": "male",
        "age": "16",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b62479-mYcTkU1RXymL.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 62479
      }
    },
    {
      "id": "krista-lenz",
      "name": "Krista Lenz",
      "alt_names": [
        "クリスタ・レンズ",
        "Christa",
        "Cattle-Taming Goddess"
      ],
      "role": "supporting",
      "description": "__Height__: 145 cm (4'8\")\n__Affiliations__: 104th Trainees Squad, Survey Corps\n\nRanked tenth in the trainee class, Krista is a very shy and kind, caring person, often being described as a \"goddess\" or \"angel\" by her peers. She is good friends with [Ymir](https://anilist.co/character/71479/Ymir).",
      "metadata": {
        "gender": "female",
        "age": "15-",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b62481-ZZDa7vn17lMU.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 62481
      }
    },
    {
      "id": "thomas-wagner",
      "name": "Thomas Wagner",
      "alt_names": [
        "トーマス・ワグナー"
      ],
      "role": "supporting",
      "description": "Thomas Wagner was from Trost District. A member of the 104th Trainees Squad, he first met Eren Yeager while questioning him about the Colossal Titan. Later, he operated the training gear for the Three Dimensional Maneuver Gear during Eren's second attempt at his aptitude test. At Keith Shadis' orders, Thomas exchanged gear with Eren and it was discovered that Eren's gear was defective. After graduating, Thomas planned to join the Scouting Legion.   ~!After the second attack of the Colossal Titan, he was assigned to the middle guard along with Eren Yeager and Armin Arlert. Initially tasked with working under the training corps, they eventually were incorporated into the front guard due to the number of titans. Catching the group unaware, a titan lunged at the rooftop they were standing on. The group scattered but unfortunately, Thomas wasn't fast enough. He was caught and swallowed whole, while his teammate, Eren, looked on in terror.!~",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b62483-zpSlfucUEgwQ.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 62483
      }
    },
    {
      "id": "dot-pixis",
      "name": "Dot Pixis",
      "alt_names": [
        "ドット・ピクシス",
        "Dot Pyxis",
        "Commander Pyxis"
      ],
      "role": "supporting",
      "description": "The highest-ranked Administrator of the Southern Region. Head of the Garrison's Southern Territories, Pixis is a cunning leader with astute insights. However, he is also an alcoholic who is constantly watched over by his aid, [Anka](https://anilist.co/character/84331/Anka-Rheinberger), who constantly scolds him for sleeping and drinking during critical moments.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b62485-I0U5Cat3z65K.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 62485
      }
    },
    {
      "id": "ilse-langnar",
      "name": "Ilse Langnar",
      "alt_names": [
        "イルゼ・ラングナー"
      ],
      "role": "supporting",
      "description": "__Affiliation:__ Survey Corps; Soldier. \n\nIlse Langnar was a member of the Scout Regiment. She was a participant of the 34th expedition beyond the Walls and was in charge of the left wing of the second brigade who went MIA. In a notebook, she documented information regarding an [Abnormal Titan](https://anilist.co/character/133213/Abnormal-Titan) she encountered, which later was discovered and aided in [Hange Zoë's](https://anilist.co/character/71121/Hange-Zoe) research. \n\nIlse appeared to be quite emotional, yet brave, attempting to stand firm in moments of despair. She seemed to be a very devoted and smart soldier. She cared deeply for her family, regretful of being unable to give anything back to her parents. Ilse thought of herself as a proud member of the Survey Corps and resolved to do whatever she could to benefit the branch.",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/62487-XnpqXJq5Vig7.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 62487
      }
    },
    {
      "id": "petra-ral",
      "name": "Petra Ral",
      "alt_names": [
        "ペトラ・ラル",
        "Petra Rall"
      ],
      "role": "supporting",
      "description": "__Height:__ 158 cm (5'2\")\n__Affiliation:__ Survey Corps; Soldier, Special Operations Squad.\n__Relatives:__ [Father](https://anilist.co/character/131987/Petra-no-Chichi)\n\nPetra Ral is a soldier of the Survey Corps hand-picked by [Captain Levi](https://anilist.co/character/45627/Levi) to join the Special Operations Squad.\n\nPetra is a very kind and caring woman, going out of her way to look after and guiding [Eren Yaeger](https://anilist.co/character/40882/Eren-Yeager) when he was first admitted to the squad. She seemed to have the most attachment to Eren among Levi Squad, as she was often the only one shown to actually worry about him and his wellbeing, at least at first. Although all of Levi's squad wished for Eren's unconditional trust, it was ultimately Petra who convinced him to do so. \n\nDespite her kind nature, Petra was a conditioned soldier with a quick reaction time against perceived danger. She displays extreme loyalty to her leaders, superiors and their orders, and cares deeply for her team, although she tends to be at odds with [Oluo Bozad](https://anilist.co/character/71687/Oluo-Bozard) due to his irritating tendency to try and imitate Levi. She greatly looks up to Levi as her superior and is deeply devoted to him, willing to completely dedicate her life to his cause. It is implied that she may harbor romantic feelings for her captain.",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/n62501-CfTtAAgs64nE.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 62501
      }
    },
    {
      "id": "mike-zacharias",
      "name": "Mike Zacharias",
      "alt_names": [
        "マイク・ザカリアス",
        "Miche"
      ],
      "role": "supporting",
      "description": "Squad Captain of his own squad, Squad Mike, a major division within the Survey Corps. He has been described by others as \"humanity's second strongest soldier\", being only behind [Levi](https://anilist.co/character/45627/Levi).\n\nMike is an extremely strong and durable soldier and an acknowledged leader with a brave heart and a tactical mind. He also has a remarkably good sense of smell, which allows him to detect Titans from great distances. During times of ease, Mike is shown to be a quiet and reserved man, rarely speaking unless it concerned a more serious matter. He also has a bizarre habit of \"sniffing\" people when he meets them.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/71119.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 71119
      }
    },
    {
      "id": "hange-zoe",
      "name": "Hange Zoe",
      "alt_names": [
        "ハンジ・ゾエ",
        "Hange Zoë",
        "Hanji",
        "Hans"
      ],
      "role": "supporting",
      "description": "__Height:__ 170 cm (5'7\")\n__Affiliation:__ Survey Corps; Section Commander, Squad Leader.\n\nLeader of the Survey Corps' Fourth Squad, Hange is also in charge of conducting research on Titans, and pursues this knowledge so passionately that they have become obsessed with Titans as a result. After originally holding a deep hatred for the creatures, Hange decided to take on a new outside-the-box approach to their research by letting go of their resentment towards Titans and approaching the test subjects with compassion. \n\nHange is an energetic, freethinking and quirky scientist, with a unique way of conducting both themselves and their work. Hange is a genius outside of just Titan research too, using their brain to create weapons, tactical plans, and inventions for the benefit of humanity. As a leader, Hange is thoughtful of their comrades, and can easily figure out complex problems in order to create plans for their teammates to carry out.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b71121-7R7CnQd3lHgt.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 71121
      }
    },
    {
      "id": "nile-dok",
      "name": "Nile Dok",
      "alt_names": [
        "ナイル・ドーク"
      ],
      "role": "supporting",
      "description": "Chief of the Military Police.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b71123-FswK9rrdbR9h.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 71123
      }
    },
    {
      "id": "darius-zackly",
      "name": "Darius Zackly",
      "alt_names": [
        "ダリス・ザックレー"
      ],
      "role": "supporting",
      "description": "The head of all three divisions of the army.   \n\n__ _Note:___ Darius Zackly is the official English translation by Kodansha.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b71125-XXymqijVoYzV.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 71125
      }
    },
    {
      "id": "nick",
      "name": "Nick",
      "alt_names": [
        "ニック",
        "Minister Nick"
      ],
      "role": "supporting",
      "description": "Pastor Nick is a member of a religion that worships the Walls as holy.  He claims that he lost his family as a result of addiction to Vine.   As a religious leader, Pastor Nick used his influence to oppose any modification of the walls, be it permanently sealing the gates or even mounting cannons on the top. Though he claimed it was blasphemy for humans to \"maim\" the wall,  ~!the real reason was to reduce the risk of workers discovering the Titans within during renovations.!~ (Source: Shingeki no Kyojin Wikia)  Note: Minister Nick is the official English translation by Kodansha.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/n71453-IxgKWV5eR1pw.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 71453
      }
    }
  ],
  "updated_at": "2025-12-22T19:23:50.654Z"
}