{
  "work_id": "hunter-x-hunter",
  "count": 25,
  "characters": [
    {
      "id": "killua-zoldyck",
      "name": "Killua Zoldyck",
      "alt_names": [
        "キルア=ゾルディック",
        "Kill",
        "Kil",
        "Evans"
      ],
      "role": "protagonist",
      "description": "__Height:__ 158 cm (5'2\")\n\nKillua is a member of the Zoldyck family, who are all legendary assassins. Since birth, he trained endlessly in the art of assassination. He eventually ran away from his family and profession to participate in the Hunter exam. He befriended [Gon](https://anilist.co/character/30/Gon-Freecss) almost immediately and has loyally followed him since then. Killua is usually a kind-hearted and playful boy, but once provoked he becomes extremely violent and bloodthirsty. This seems to be a trait he got from [his father](https://anilist.co/character/60/Silva-Zoldyck), who believes that Killua would eventually return home as an assassin. He is also a transmuter and constantly strives to improve his nen ability, developing many interesting techniques as the show progresses.\n\n(Source: Hunter x Hunter Wiki)",
      "metadata": {
        "gender": "male",
        "age": "11-",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b27-Z5O02kQUydpT.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 27
      }
    },
    {
      "id": "kurapika",
      "name": "Kurapika",
      "alt_names": [
        "クラピカ",
        "Chain User",
        "Chain Bastard"
      ],
      "role": "protagonist",
      "description": "__Height__: 171 cm (5'7\")\n\nKurapika is a member of the Kurta tribe who were massacred by the Phantom Troupe (The Spiders) 4 years prior the Hunter exam. The Kurta tribe was an isolated group of people whose eyes would turn scarlet when angered or excited. These scarlet eyes were known to be beautiful, being one of the seven most beautiful things in the world. Because of this, the Kurta tribe was constantly pursued and eventually massacred. The eyes of the tribe members were all taken away during the massacre. Kurapika is so far the only known survivor with a heart bent on revenge. He strives to have his revenge against the Phantom Troupe as well as to recover the eyes of his tribe members.  Despite having a heart full of hatred, Kurapika is very kind and loyal towards his friends. He is an extremely intelligent person but at the same time reckless.",
      "metadata": {
        "gender": "male",
        "age": "17-",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b28-ivA7UGnfE40a.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 28
      }
    },
    {
      "id": "leorio-paradinight",
      "name": "Leorio Paradinight",
      "alt_names": [
        "レオリオ・パラディナイト",
        "Leorio Paradiknight",
        "Leorio Paladiknight"
      ],
      "role": "protagonist",
      "description": "__Height:__ 193 cm (6'4\")\n\nPrior to the hunter exam, Leorio's close friend died to a curable illness, and Leorio was unable to save him due to his lack of money and knowledge. Because of this. he aims to become a doctor in order to help those without the money to pay for treatment.  In order to cover his tuition for medical school, he decides to take the hunter exam, where he meets Gon, Killua, and Kurapika. Leorio is also talented at bargaining, being able to haggle shopkeepers to no end. He often seems brash and rude, but overall he cares deeply for his friends. Leorio is an emitter, although learning nen did not come easily to him.",
      "metadata": {
        "gender": "male",
        "age": "19-",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b29-RgzoSeKmDYzl.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 29
      }
    },
    {
      "id": "gon-freecss",
      "name": "Gon Freecss",
      "alt_names": [
        "ゴン＝フリークス"
      ],
      "role": "protagonist",
      "description": "__Height:__ 154 cm (5'1\")\n\nGon is the son of [Ging Freecss](https://anilist.co/character/26/Ging-Freecss), a legendary hunter whose current whereabouts are unknown. He never knew his father was alive, much less a hunter until he met [Kite](https://anilist.co/character/20594/Kite); a hunter who was also looking for Ging. From this point on, he became determined to find his father and decided to take the Hunter exam to do so. He became friends with [Killua](https://anilist.co/character/27/Killua-Zoldyck) almost instantly when they met at the Hunter exam. Gon's an innocent and naive boy who is willing to help anyone, especially his friends. He rarely ever looks at anything in a bad way. His curious and naive personality often frustrates his friends, but this is also the reason why many people are attracted to him. He is also from the enhancement nen group. He usually fights barehanded or with his fishing rod, but Gon's fist is usually more deadly than any weapon.",
      "metadata": {
        "gender": "male",
        "age": "11-",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b30-lyFExKyDhefc.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 30
      }
    },
    {
      "id": "hisoka-morow",
      "name": "Hisoka Morow",
      "alt_names": [
        "ヒソカ・モロウ",
        "Hisoka Morou",
        "The Magician",
        "Grim Reaper"
      ],
      "role": "protagonist",
      "description": "__Height: __187 cm\n\nNotorious for his cruel and deceitful fighting ability, Hisoka has proven to be deadly. His deviousness and volatility have caused many opponents to have difficulty anticipating his next move, and this has led to him winning many battles. Using Shu powered poker cards as his primary weapon, he throws them with ease and deadly accuracy.  Also, he is very intrigued by [Gon](https://anilist.co/character/30/Gon-Freecss) and the potential this young boy has to become an adept and powerful adversary. Hisoka, ever looking for a strong opponent, is willing to aid, or at least not defeat prematurely, someone that could develop into a future opponent.\n\n(Source: HunterHunter Wikia, HxH Japanese Wikipedia)",
      "metadata": {
        "gender": "male",
        "age": "28",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b31-FZckOuu7L1un.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 31
      }
    },
    {
      "id": "ging-freecss",
      "name": "Ging Freecss",
      "alt_names": [
        "ジン・フリークス"
      ],
      "role": "supporting",
      "description": "__Height:__ 176 cm (5'9\")\n\nA famous 2-star ancient ruins hunter and the father of Gon Freeccs. When Ging was a child, he left his home on Whale Island to become a hunter and did not return home for 10 years, carrying a young Gon whom he entrusted to Mito. He is the primary reason Gon decides to leave home, following in his footsteps to become a hunter and find his father. ~!He is one of the founders of the legendary video game Greed Island.!~ ~!He is also a member of the Zodiacs, having as a sign the boar.!~",
      "metadata": {
        "gender": "male",
        "age": "31-",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/26-VpZXIwOdcz8p.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 26
      }
    },
    {
      "id": "illumi-zoldyck",
      "name": "Illumi Zoldyck",
      "alt_names": [
        "イルミ＝ゾルディック"
      ],
      "role": "supporting",
      "description": "__Height:__ 185 cm \n__Nen Type:__ Manipulation   \n\nIllumi is [Killua](https://anilist.co/character/27/Killua-Zoldyck)'s eldest brother. He is an experienced assassin, whom along with his father was responsible for Killua's training and upbringing. During the Hunter Exam, Illumi masked his appearance and used an alias, using special pins to change his entire facial structure to the point where he could only be recognized by his voice. His oppressive evil aura makes even Killua fearful and wary whenever he approaches Illumi.",
      "metadata": {
        "gender": "male",
        "age": "24",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b57-pTFguojSOQZW.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 57
      }
    },
    {
      "id": "chrollo-lucilfer",
      "name": "Chrollo Lucilfer",
      "alt_names": [
        "クロロ・ルシルフル",
        "Kuroro Rushirufuru",
        "Danchou",
        "Quwrof Wrlccywrlir"
      ],
      "role": "supporting",
      "description": "__Height:__ 177 cm \n__Occupation:__ Leader of the Phantom Troupe \n__Nen Type:__ Specialization  \n \nChrollo Lucilfer is a calm, young man, coming across as intelligent and charismatic. He seems to be a born leader, able to hold the Genei Ryodan (Phantom Troupe) together despite the volatile personalities that make up the group. He is also an incredibly skilled fighter.",
      "metadata": {
        "gender": "male",
        "age": "26",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b58-USOmsz3nursi.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 58
      }
    },
    {
      "id": "zeno-zoldyck",
      "name": "Zeno Zoldyck",
      "alt_names": [
        "ゼノ＝ゾルディック"
      ],
      "role": "supporting",
      "description": "Zeno Zoldyck is Killua's grandfather and Silva's father. A witty old man, his advancing age has not dampened his quick thinking and speed in battle. Zeno wears alternating signs on his garb that say either \"A Kill A Day\" or \"Never Retire.\" He appears to be on good terms with the Hunter Committee's Chairman, Netero, who hired Zeno to assault Ming Jol-ik's palace in East Gorteau in order to catch the chimera ant King off guard. Zeno favors Killua more than his other grandchildren, most likely because Killua is the heir of the family.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/n59-6mnrlhnGe2mw.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 59
      }
    },
    {
      "id": "silva-zoldyck",
      "name": "Silva Zoldyck",
      "alt_names": [
        "シルバ＝ゾルディック"
      ],
      "role": "supporting",
      "description": "Silva is Killua's father. He is a silent, pensive figure, and Killua seems to rarely interact with him, although Killua does look up to him. He allows Killua to go along with Gon on their journey, but this is only so Killua would gain more experience when thrown out into the real world on his own. In fact, Silva was confident that Killua would eventually return home on his own, as an assassin.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/60.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 60
      }
    },
    {
      "id": "feitan-portor",
      "name": "Feitan Portor",
      "alt_names": [
        "フェイタン",
        "Fei"
      ],
      "role": "supporting",
      "description": "A mysterious member of the Phantom Troupe, Feitan is attired in what one would expect from a bandit - dark clothes with a skullhead scarf that covers his mouth. Feitan seldom speaks, but when he does, there's usually a word missing. Feitan's first language most likely isn't Japanese, but he has shown to be rather proficient in the Chinese language. He is one of the original members hailing from Meteor City.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/3195.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 3195
      }
    },
    {
      "id": "bonolenov-ndongo",
      "name": "Bonolenov Ndongo",
      "alt_names": [
        "ボノレノフ゠ンドンゴ"
      ],
      "role": "supporting",
      "description": "Bonolenov is member number 13 of the Phantom Troupe. He dresses partially in rags and looks like a mummy. During the Yorknew City arc, his appearance was insignificant. During the Chimera Ant arc, he was seen fighting with the rest of the Phantom Troupe against the Chimera ants. Very little is known about his personality and reasons for joining the Troupe, but in the fight with the Chimera ants he displays a mocking and confident attitude.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/5827.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 5827
      }
    },
    {
      "id": "franklin-bordeaux",
      "name": "Franklin Bordeaux",
      "alt_names": [
        "フランクリン"
      ],
      "role": "supporting",
      "description": "A hulking, Frankensteinian monster is what Franklin (Furankurin) appears to be, complete with scars and sewn-up wounds that ravage his face. It does seem though, that beneath his harsh exterior lies a small, caring spot in his character, as Franklin acts as a caregiver to Shizuku, and shows concern of her well-being. He is also composed and respectful, normally breaking up arguments and fights within the organization. He is one of the members of the Phantom Troupe that originated from Meteor City.  Nen Ability - Double Machine Gun: Franklin is a human machine gun, as his fingers cap off to reveal chambers where he channels his nen that shoot out as bullets. His fingers weren't required to be cut off and used as caps in order to achieve this, but Franklin did so because he felt \"it would be more effective.\" Doing this actually did greatly enhance the force of his Nen Bullets, due to the commitment he showed in doing so. This power has been shown to wipe out a room full of people within seconds.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/n5828-cMOh5ifgAEW1.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 5828
      }
    },
    {
      "id": "kortopi",
      "name": "Kortopi",
      "alt_names": [
        "コルトピ",
        "Koltopi"
      ],
      "role": "supporting",
      "description": "As one of the members of the Phantom Troupe, the most distinctive thing about Kortopi is his haggard appearance. A thick and messy mane of hair flops down his face, obscuring everything except for an occasional glimpse of his eyeball. \n\n__Nen Ability:__ \nGallery Fake - Divine Left Hand, Demonic Right Hand: When Koltopi touches an object with his left hand, his nen ability allows him to make an exact replica of that object with his right hand. He cannot replicate living things except as inanimate objects (as he created the fake corpses of his fellow members), and Koltopi is also unable to replicate another user's nen. The replicas that he creates vanish after 24 hours, regardless of their size. However, before their disappearance, Koltopi is able to track the movements of each and every copied object (providing that he can touch the originals).",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/n5829-ubGjeYxlPnxL.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 5829
      }
    },
    {
      "id": "machi-komacine",
      "name": "Machi Komacine",
      "alt_names": [
        "マチ゠コマチネ"
      ],
      "role": "supporting",
      "description": "__Height:__ 159 cm \n\nNot known to show much emotion, Machi seems to be one of the coldest members of the Phantom Troupe. The only person she has shown some feeling towards was Chrollo. Hisoka seems to have an occasional interest with her, although it's hard to see whether it's genuine, given Hisoka's unpredictability. Machi also doesn't appear to be interested in him, spurning his advances on all occasions. Machi is one of the Phantom Troupe that originated from Meteor City.  \n\n__Nen Ability:__ \nMachi's nen transforms into thin wispy-long threads in which she uses in a variety of ways, including seaming together old wounds to heal them, repairing back dislodged limbs and forming a noose that can strangle enemies with a tug. Her thread's strength is inversely proportional to the length. The longer the thread she makes, the easier it is to break. ~!She uses her nen ability on Hisoka after his duel in Heavens Arena.!~",
      "metadata": {
        "gender": "female",
        "age": "24",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b5830-IEl8BCasHZvG.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 5830
      }
    },
    {
      "id": "nobunaga-hazama",
      "name": "Nobunaga Hazama",
      "alt_names": [
        "ノブナガ＝ハザマ"
      ],
      "role": "supporting",
      "description": "Like one of the ronin warriors in Edo period Japan, Nobunaga comes complete with a long Japanese sword that he uses with great finesse and skill. Nobunaga's speciality is the unparalleled use of the sword in executing enemies. Franklin has described him as the \"King of Carelessness.\" His best friend is Uvogin, and the two bring out the best in each other during combat. Seeing some of Uvogin's personality in Gon, he expressed interest in having Gon join the Troupe, though Gon adamantly refused. He is one of the Phantom Troupe that originated from Meteor City.  \n\nNobunaga's En: Supplementing his swordfighting skills is the use of En in creating a circular boundary that can detect the slightest of movements of his opponents. Once the opponent steps into this boundary, an immediate retaliation can be expected from Nobunaga.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/n5831-COYqtVagw99J.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 5831
      }
    },
    {
      "id": "shalnark-ryuseih",
      "name": "Shalnark Ryuseih",
      "alt_names": [
        "シャルナーク=リュウセイ",
        "Shal"
      ],
      "role": "supporting",
      "description": "From his appearance, Shalnark seems to be a guileless and normal boy. However, see him in action with the rest of the Phantom Troupe and that thought is dispelled.\n\nShalnark is one of the most intelligent and quick-thinking members in the group —being adept at using technology for information gathering, providing the brains behind the brawn. Shalnark is also a Hunter, so he has the ability to gain access to certain information that could be potentially useful for the Phantom Troupe He is member number 9 of the Troupe. \n\n__Nen Abilities:__  \nBlack Voice - Mobile Fate Detector: Shalnark is able to control the physical movements of any person he has targeted, as long as he has a special antenna on them and that person is not already being controlled. This is done via a cellphone interface in which he remotely controls other people from a distance while pointing the antenna at the person he's controlling.\nAuto Mode: When Shalnark places an antenna on himself, he temporarily gains immense strength. However, he can only control himself through giving himself instructions and cannot withdraw from Auto Mode until he has accomplished the task. After going out of Auto Mode, Shalnark cannot move for two days. He also doesn't retain any memory from what happened in that state.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/5832.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 5832
      }
    },
    {
      "id": "shizuku-murasaki",
      "name": "Shizuku Murasaki",
      "alt_names": [
        "シズク"
      ],
      "role": "supporting",
      "description": "Shizuku is member number 8 of the Phantom Troupe. She has been described as being a natural airhead, seeing as how some of her actions do not point towards her being very bright. Shizuku is quite forgetful; once she forgets something, she won't remember it. Her opponents are often fooled by her unassuming and blurred appearance—but this has often proved to be fatal for them once she enters in combat. Shizuku is also left-handed.\n\n__Nen Ability:__ \nDeme-chan (Blinky): Shizuku uses her nen to create a self-styled \"living\" vacuum cleaner she names \"Deme-chan\" that is able to consume any inanimate matter under her command. This has proven very useful in many occasions for cleaning up evidence that the members leave behind, especially blood and dead corpses. She also uses the razor-sharp teeth on the \"mouth\" as a weapon when in combat. Anything sucked up into her vacuum cleaner cannot be retrieved, except for the last material that was sucked in.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/5833.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 5833
      }
    },
    {
      "id": "phinks-magcub",
      "name": "Phinks Magcub",
      "alt_names": [
        "フィンクス"
      ],
      "role": "supporting",
      "description": "Phinks is a genius when it comes to unarmed combat. Phinks uses his hands in battle, which have been shown to be extremely powerful. He is rather brash and has a tendency to get into conflicts with other people. Phinks is one of the members of the Phantom Troupe that originated from Meteor City. He first appears in Egyptian Suit but later changed into jogging suit. He seems to get along with Feitan. Phinks also displays a level of compassion for Zazan's minions after they are released from her control. When they beg him to kill them he refuses to simply execute them on their knees, instead urging them to fight back and die in battle honorably. \n\n__Nen Ability:__ \nRipper Cyclotron: Phinks's nen ability involves how many times he rotates his arm. The more rotations that he does with the arm, the stronger his blow will become.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/n5834-s3A4bR8IX01p.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 5834
      }
    },
    {
      "id": "pakunoda",
      "name": "Pakunoda",
      "alt_names": [
        "パクノダ",
        "Paku",
        "Phalcnothdk"
      ],
      "role": "supporting",
      "description": "Pakunoda exudes an air of self-confidence that can be intimidating to others. She is fully loyal to Chrollo. She is one of the original Phantom Troupe from Meteor City. Her physical strength is 11th in the Troupe. \n\nShe has the ability to read the conscious thoughts of any person she is in physical contact with and can extract memories by asking specific questions. Attempting to create false information is impossible, since she can extract her target's purest memories. The information she collects is highly useful in exposing weaknesses and secrets, especially in finding out the opponent's nen ability or in situations requiring some form of extortion or blackmail. Her ability can also be used to see the recent past of an object. \n\nShe also has the ability to share her memories by shooting them into another person's head using a revolver and conjured nen bullets called \"Memory Bombs\". This is not a combat ability, and does no damage. If she shoots a Memory Bomb into the person from whom the memories were read, those memories are erased permanently.",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b5835-cbomgYG3LWrP.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 5835
      }
    },
    {
      "id": "uvogin",
      "name": "Uvogin",
      "alt_names": [
        "ウボォーギン",
        "Uvo"
      ],
      "role": "supporting",
      "description": "Uvogin is the eleventh member of the Phantom Troupe. Nobunaga has compared his personality to Gon's, seeing how not only do they have the same Nen type, but their behavior is similar as well, being impulsive and short tempered. \n\nUvogin is one of the Phantom Troupe that originated from Meteor City. However, like all of the Phantom Troupe, Uvogin doesn't hesitate to kill anyone. Out of all of the Phantom Troupe, Uvogin is the strongest in terms of physical power. Although he prefers to fight alone, Uvogin works best when fighting with a partner (specifically, Nobunaga) as he fights better when he has someone else to protect, though he would never admit it.\n\n~!Uvogin and Kurapika fought alone in the outskirt deserts of Yorknew where Kurapika eventually pierced him with his Chain of Judgement. During the final moments of the conflict Kurapika told Uvogin that if he spoke again dishonestly then he would die, but if he spoke the truth he would let him live just a little longer. He lastly orders Uvogin to reveal the location of his comrades to which Uvogin tells him to go to hell and subsequently dies due to the Judgement Chain. Uvogin's death is a significant loss to the Phantom Troupe. !~  \n\n__Nen Ability:__  \n~!Big Bang Impact: Uvogin has seasoned his nen to the point where he has 100% power in the enhancement type. He can strengthen his muscles to the point where neither bullets nor missiles will have much of an effect on him and can strengthen even his vocal cords in order to kill someone. His favorite ability is his \"Big Bang Impact\", where Uvogin focuses all of the aura to his fist with kou and lets loose, creating an impact as powerful as a bomb.!~",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/5836.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 5836
      }
    },
    {
      "id": "menchi",
      "name": "Menchi",
      "alt_names": [
        "メンチ"
      ],
      "role": "supporting",
      "description": "One of the two examiners that presided over the second stage of the Exam. Her exam topic was to prepare a piece of sushi for her to taste. If it met up to her stringent expectations, the candidate would pass.",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b6088-Bih7EhJL1QE6.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 6088
      }
    },
    {
      "id": "kalluto-zoldyck",
      "name": "Kalluto Zoldyck",
      "alt_names": [
        "カルト＝ゾルディック"
      ],
      "role": "supporting",
      "description": "Kalluto Zoldyck is the younger brother of Killua. He was initially introduced accompanying his mother during Gon's retrieval of Killua from his home on Kukuroo Mountain. Kalluto appears again during the Yorknew City arc, assisting his older brother Illumi with the assassination of the ten mafia dons that placed bounties on the Phantom Troupe's heads. After the Phantom Troupe's entrance into Greed Island, Kalluto joins as Hisoka's replacement. During the Phantom Troupe's assault on Zazan's palace in Meteor City, he reveals he joined the Spiders with the intention of bringing Killua back home.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/n6089-ro8HdSKvlycB.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 6089
      }
    },
    {
      "id": "leroute",
      "name": "Leroute",
      "alt_names": [
        "レルート"
      ],
      "role": "supporting",
      "description": "Leroute is a criminal who manipulates her victims. She is smart, sharp, and insightful. Leroute was formerly a deranged psychologist who reveled in the misery of her clients. She often attacked her victims psychologically to such a degree that they often committed suicide.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/n10535-iCSNBBSq22iD.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 10535
      }
    },
    {
      "id": "neferpitou",
      "name": "Neferpitou",
      "alt_names": [
        "ネフェルピトウ",
        "Pitou"
      ],
      "role": "supporting",
      "description": "__Nen Type:__ Specialization\n\nA cat-humanoid Chimera Ant and the firstborn of the Chimera Ant King's three Royal Guards.\n\nNeferpitou is very loyal to the King, just like the rest of the Royal Guards that would sacrifice themselves for him. Neferpitou gets distracted easily, loves to play a lot and that makes them the most curious of the three Royal Guards. Hence their cat-like appearance, Pitou is a cat Chimera Ant who loves to play with their opponents like a cat would with their prey. Despite their cheerful and playful manner, Pitou has a sadistic and terrifying personality as well. \n\nUnlike Menthuthuyoupi and Shaiapouf, Neferpitou does not seem to mind much in regards to Meruem's later newfound interests with Komugi. Thus, among the three Royal Guards, Neferpitou is the only one that greatly prioritizes Komugi's safety as opposed to how Menthuthuyoupi and Shaiapouf hate Komugi, which causes tension among the guards.\n\n~!When the day of the selection finally occurs, the Extermination Team attacks the palace and causes massive damage. The King's consort, Komugi, is mortally wounded and under the King's orders, Neferpitou heals her; Neferpitou noticeably begins to sheds tears, understanding the King's sorrow and the importance of the order.\n\nThough a promise was made to go with Gon to Peijin to restore Kite, once they've reached the area, Neferpitou affirms that it is impossible and subsequently prepares to kill Gon. Gon then forcibly ages his body by sacrificing nearly all of his aura and kills Neferpitou in battle.!~",
      "metadata": {
        "gender": "non-binary",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b12300-kYzopQUTLa9A.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 12300
      }
    }
  ],
  "updated_at": "2025-12-22T19:30:55.890Z"
}