{
  "work_id": "hunter-x-hunter-2011",
  "count": 50,
  "characters": [
    {
      "id": "gon-freecss",
      "name": "Gon Freecss",
      "alt_names": [
        "ゴン＝フリークス"
      ],
      "role": "protagonist",
      "description": "__Height:__ 154 cm (5'1\")\n\nGon is the son of [Ging Freecss](https://anilist.co/character/26/Ging-Freecss), a legendary hunter whose current whereabouts are unknown. He never knew his father was alive, much less a hunter until he met [Kite](https://anilist.co/character/20594/Kite); a hunter who was also looking for Ging. From this point on, he became determined to find his father and decided to take the Hunter exam to do so. He became friends with [Killua](https://anilist.co/character/27/Killua-Zoldyck) almost instantly when they met at the Hunter exam. Gon's an innocent and naive boy who is willing to help anyone, especially his friends. He rarely ever looks at anything in a bad way. His curious and naive personality often frustrates his friends, but this is also the reason why many people are attracted to him. He is also from the enhancement nen group. He usually fights barehanded or with his fishing rod, but Gon's fist is usually more deadly than any weapon.",
      "metadata": {
        "gender": "male",
        "age": "11-",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b30-lyFExKyDhefc.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 30
      }
    },
    {
      "id": "killua-zoldyck",
      "name": "Killua Zoldyck",
      "alt_names": [
        "キルア=ゾルディック",
        "Kill",
        "Kil",
        "Evans"
      ],
      "role": "protagonist",
      "description": "__Height:__ 158 cm (5'2\")\n\nKillua is a member of the Zoldyck family, who are all legendary assassins. Since birth, he trained endlessly in the art of assassination. He eventually ran away from his family and profession to participate in the Hunter exam. He befriended [Gon](https://anilist.co/character/30/Gon-Freecss) almost immediately and has loyally followed him since then. Killua is usually a kind-hearted and playful boy, but once provoked he becomes extremely violent and bloodthirsty. This seems to be a trait he got from [his father](https://anilist.co/character/60/Silva-Zoldyck), who believes that Killua would eventually return home as an assassin. He is also a transmuter and constantly strives to improve his nen ability, developing many interesting techniques as the show progresses.\n\n(Source: Hunter x Hunter Wiki)",
      "metadata": {
        "gender": "male",
        "age": "11-",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b27-Z5O02kQUydpT.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 27
      }
    },
    {
      "id": "kurapika",
      "name": "Kurapika",
      "alt_names": [
        "クラピカ",
        "Chain User",
        "Chain Bastard"
      ],
      "role": "protagonist",
      "description": "__Height__: 171 cm (5'7\")\n\nKurapika is a member of the Kurta tribe who were massacred by the Phantom Troupe (The Spiders) 4 years prior the Hunter exam. The Kurta tribe was an isolated group of people whose eyes would turn scarlet when angered or excited. These scarlet eyes were known to be beautiful, being one of the seven most beautiful things in the world. Because of this, the Kurta tribe was constantly pursued and eventually massacred. The eyes of the tribe members were all taken away during the massacre. Kurapika is so far the only known survivor with a heart bent on revenge. He strives to have his revenge against the Phantom Troupe as well as to recover the eyes of his tribe members.  Despite having a heart full of hatred, Kurapika is very kind and loyal towards his friends. He is an extremely intelligent person but at the same time reckless.",
      "metadata": {
        "gender": "male",
        "age": "17-",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b28-ivA7UGnfE40a.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 28
      }
    },
    {
      "id": "leorio-paradinight",
      "name": "Leorio Paradinight",
      "alt_names": [
        "レオリオ・パラディナイト",
        "Leorio Paradiknight",
        "Leorio Paladiknight"
      ],
      "role": "protagonist",
      "description": "__Height:__ 193 cm (6'4\")\n\nPrior to the hunter exam, Leorio's close friend died to a curable illness, and Leorio was unable to save him due to his lack of money and knowledge. Because of this. he aims to become a doctor in order to help those without the money to pay for treatment.  In order to cover his tuition for medical school, he decides to take the hunter exam, where he meets Gon, Killua, and Kurapika. Leorio is also talented at bargaining, being able to haggle shopkeepers to no end. He often seems brash and rude, but overall he cares deeply for his friends. Leorio is an emitter, although learning nen did not come easily to him.",
      "metadata": {
        "gender": "male",
        "age": "19-",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b29-RgzoSeKmDYzl.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 29
      }
    },
    {
      "id": "hisoka-morow",
      "name": "Hisoka Morow",
      "alt_names": [
        "ヒソカ・モロウ",
        "Hisoka Morou",
        "The Magician",
        "Grim Reaper"
      ],
      "role": "protagonist",
      "description": "__Height: __187 cm\n\nNotorious for his cruel and deceitful fighting ability, Hisoka has proven to be deadly. His deviousness and volatility have caused many opponents to have difficulty anticipating his next move, and this has led to him winning many battles. Using Shu powered poker cards as his primary weapon, he throws them with ease and deadly accuracy.  Also, he is very intrigued by [Gon](https://anilist.co/character/30/Gon-Freecss) and the potential this young boy has to become an adept and powerful adversary. Hisoka, ever looking for a strong opponent, is willing to aid, or at least not defeat prematurely, someone that could develop into a future opponent.\n\n(Source: HunterHunter Wikia, HxH Japanese Wikipedia)",
      "metadata": {
        "gender": "male",
        "age": "28",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b31-FZckOuu7L1un.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 31
      }
    },
    {
      "id": "ging-freecss",
      "name": "Ging Freecss",
      "alt_names": [
        "ジン・フリークス"
      ],
      "role": "supporting",
      "description": "__Height:__ 176 cm (5'9\")\n\nA famous 2-star ancient ruins hunter and the father of Gon Freeccs. When Ging was a child, he left his home on Whale Island to become a hunter and did not return home for 10 years, carrying a young Gon whom he entrusted to Mito. He is the primary reason Gon decides to leave home, following in his footsteps to become a hunter and find his father. ~!He is one of the founders of the legendary video game Greed Island.!~ ~!He is also a member of the Zodiacs, having as a sign the boar.!~",
      "metadata": {
        "gender": "male",
        "age": "31-",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/26-VpZXIwOdcz8p.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 26
      }
    },
    {
      "id": "illumi-zoldyck",
      "name": "Illumi Zoldyck",
      "alt_names": [
        "イルミ＝ゾルディック"
      ],
      "role": "supporting",
      "description": "__Height:__ 185 cm \n__Nen Type:__ Manipulation   \n\nIllumi is [Killua](https://anilist.co/character/27/Killua-Zoldyck)'s eldest brother. He is an experienced assassin, whom along with his father was responsible for Killua's training and upbringing. During the Hunter Exam, Illumi masked his appearance and used an alias, using special pins to change his entire facial structure to the point where he could only be recognized by his voice. His oppressive evil aura makes even Killua fearful and wary whenever he approaches Illumi.",
      "metadata": {
        "gender": "male",
        "age": "24",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b57-pTFguojSOQZW.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 57
      }
    },
    {
      "id": "chrollo-lucilfer",
      "name": "Chrollo Lucilfer",
      "alt_names": [
        "クロロ・ルシルフル",
        "Kuroro Rushirufuru",
        "Danchou",
        "Quwrof Wrlccywrlir"
      ],
      "role": "supporting",
      "description": "__Height:__ 177 cm \n__Occupation:__ Leader of the Phantom Troupe \n__Nen Type:__ Specialization  \n \nChrollo Lucilfer is a calm, young man, coming across as intelligent and charismatic. He seems to be a born leader, able to hold the Genei Ryodan (Phantom Troupe) together despite the volatile personalities that make up the group. He is also an incredibly skilled fighter.",
      "metadata": {
        "gender": "male",
        "age": "26",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b58-USOmsz3nursi.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 58
      }
    },
    {
      "id": "zeno-zoldyck",
      "name": "Zeno Zoldyck",
      "alt_names": [
        "ゼノ＝ゾルディック"
      ],
      "role": "supporting",
      "description": "Zeno Zoldyck is Killua's grandfather and Silva's father. A witty old man, his advancing age has not dampened his quick thinking and speed in battle. Zeno wears alternating signs on his garb that say either \"A Kill A Day\" or \"Never Retire.\" He appears to be on good terms with the Hunter Committee's Chairman, Netero, who hired Zeno to assault Ming Jol-ik's palace in East Gorteau in order to catch the chimera ant King off guard. Zeno favors Killua more than his other grandchildren, most likely because Killua is the heir of the family.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/n59-6mnrlhnGe2mw.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 59
      }
    },
    {
      "id": "silva-zoldyck",
      "name": "Silva Zoldyck",
      "alt_names": [
        "シルバ＝ゾルディック"
      ],
      "role": "supporting",
      "description": "Silva is Killua's father. He is a silent, pensive figure, and Killua seems to rarely interact with him, although Killua does look up to him. He allows Killua to go along with Gon on their journey, but this is only so Killua would gain more experience when thrown out into the real world on his own. In fact, Silva was confident that Killua would eventually return home on his own, as an assassin.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/60.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 60
      }
    },
    {
      "id": "feitan-portor",
      "name": "Feitan Portor",
      "alt_names": [
        "フェイタン",
        "Fei"
      ],
      "role": "supporting",
      "description": "A mysterious member of the Phantom Troupe, Feitan is attired in what one would expect from a bandit - dark clothes with a skullhead scarf that covers his mouth. Feitan seldom speaks, but when he does, there's usually a word missing. Feitan's first language most likely isn't Japanese, but he has shown to be rather proficient in the Chinese language. He is one of the original members hailing from Meteor City.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/3195.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 3195
      }
    },
    {
      "id": "bonolenov-ndongo",
      "name": "Bonolenov Ndongo",
      "alt_names": [
        "ボノレノフ゠ンドンゴ"
      ],
      "role": "supporting",
      "description": "Bonolenov is member number 13 of the Phantom Troupe. He dresses partially in rags and looks like a mummy. During the Yorknew City arc, his appearance was insignificant. During the Chimera Ant arc, he was seen fighting with the rest of the Phantom Troupe against the Chimera ants. Very little is known about his personality and reasons for joining the Troupe, but in the fight with the Chimera ants he displays a mocking and confident attitude.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/5827.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 5827
      }
    },
    {
      "id": "franklin-bordeaux",
      "name": "Franklin Bordeaux",
      "alt_names": [
        "フランクリン"
      ],
      "role": "supporting",
      "description": "A hulking, Frankensteinian monster is what Franklin (Furankurin) appears to be, complete with scars and sewn-up wounds that ravage his face. It does seem though, that beneath his harsh exterior lies a small, caring spot in his character, as Franklin acts as a caregiver to Shizuku, and shows concern of her well-being. He is also composed and respectful, normally breaking up arguments and fights within the organization. He is one of the members of the Phantom Troupe that originated from Meteor City.  Nen Ability - Double Machine Gun: Franklin is a human machine gun, as his fingers cap off to reveal chambers where he channels his nen that shoot out as bullets. His fingers weren't required to be cut off and used as caps in order to achieve this, but Franklin did so because he felt \"it would be more effective.\" Doing this actually did greatly enhance the force of his Nen Bullets, due to the commitment he showed in doing so. This power has been shown to wipe out a room full of people within seconds.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/n5828-cMOh5ifgAEW1.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 5828
      }
    },
    {
      "id": "kortopi",
      "name": "Kortopi",
      "alt_names": [
        "コルトピ",
        "Koltopi"
      ],
      "role": "supporting",
      "description": "As one of the members of the Phantom Troupe, the most distinctive thing about Kortopi is his haggard appearance. A thick and messy mane of hair flops down his face, obscuring everything except for an occasional glimpse of his eyeball. \n\n__Nen Ability:__ \nGallery Fake - Divine Left Hand, Demonic Right Hand: When Koltopi touches an object with his left hand, his nen ability allows him to make an exact replica of that object with his right hand. He cannot replicate living things except as inanimate objects (as he created the fake corpses of his fellow members), and Koltopi is also unable to replicate another user's nen. The replicas that he creates vanish after 24 hours, regardless of their size. However, before their disappearance, Koltopi is able to track the movements of each and every copied object (providing that he can touch the originals).",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/n5829-ubGjeYxlPnxL.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 5829
      }
    },
    {
      "id": "machi-komacine",
      "name": "Machi Komacine",
      "alt_names": [
        "マチ゠コマチネ"
      ],
      "role": "supporting",
      "description": "__Height:__ 159 cm \n\nNot known to show much emotion, Machi seems to be one of the coldest members of the Phantom Troupe. The only person she has shown some feeling towards was Chrollo. Hisoka seems to have an occasional interest with her, although it's hard to see whether it's genuine, given Hisoka's unpredictability. Machi also doesn't appear to be interested in him, spurning his advances on all occasions. Machi is one of the Phantom Troupe that originated from Meteor City.  \n\n__Nen Ability:__ \nMachi's nen transforms into thin wispy-long threads in which she uses in a variety of ways, including seaming together old wounds to heal them, repairing back dislodged limbs and forming a noose that can strangle enemies with a tug. Her thread's strength is inversely proportional to the length. The longer the thread she makes, the easier it is to break. ~!She uses her nen ability on Hisoka after his duel in Heavens Arena.!~",
      "metadata": {
        "gender": "female",
        "age": "24",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b5830-IEl8BCasHZvG.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 5830
      }
    },
    {
      "id": "nobunaga-hazama",
      "name": "Nobunaga Hazama",
      "alt_names": [
        "ノブナガ＝ハザマ"
      ],
      "role": "supporting",
      "description": "Like one of the ronin warriors in Edo period Japan, Nobunaga comes complete with a long Japanese sword that he uses with great finesse and skill. Nobunaga's speciality is the unparalleled use of the sword in executing enemies. Franklin has described him as the \"King of Carelessness.\" His best friend is Uvogin, and the two bring out the best in each other during combat. Seeing some of Uvogin's personality in Gon, he expressed interest in having Gon join the Troupe, though Gon adamantly refused. He is one of the Phantom Troupe that originated from Meteor City.  \n\nNobunaga's En: Supplementing his swordfighting skills is the use of En in creating a circular boundary that can detect the slightest of movements of his opponents. Once the opponent steps into this boundary, an immediate retaliation can be expected from Nobunaga.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/n5831-COYqtVagw99J.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 5831
      }
    },
    {
      "id": "shalnark-ryuseih",
      "name": "Shalnark Ryuseih",
      "alt_names": [
        "シャルナーク=リュウセイ",
        "Shal"
      ],
      "role": "supporting",
      "description": "From his appearance, Shalnark seems to be a guileless and normal boy. However, see him in action with the rest of the Phantom Troupe and that thought is dispelled.\n\nShalnark is one of the most intelligent and quick-thinking members in the group —being adept at using technology for information gathering, providing the brains behind the brawn. Shalnark is also a Hunter, so he has the ability to gain access to certain information that could be potentially useful for the Phantom Troupe He is member number 9 of the Troupe. \n\n__Nen Abilities:__  \nBlack Voice - Mobile Fate Detector: Shalnark is able to control the physical movements of any person he has targeted, as long as he has a special antenna on them and that person is not already being controlled. This is done via a cellphone interface in which he remotely controls other people from a distance while pointing the antenna at the person he's controlling.\nAuto Mode: When Shalnark places an antenna on himself, he temporarily gains immense strength. However, he can only control himself through giving himself instructions and cannot withdraw from Auto Mode until he has accomplished the task. After going out of Auto Mode, Shalnark cannot move for two days. He also doesn't retain any memory from what happened in that state.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/5832.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 5832
      }
    },
    {
      "id": "shizuku-murasaki",
      "name": "Shizuku Murasaki",
      "alt_names": [
        "シズク"
      ],
      "role": "supporting",
      "description": "Shizuku is member number 8 of the Phantom Troupe. She has been described as being a natural airhead, seeing as how some of her actions do not point towards her being very bright. Shizuku is quite forgetful; once she forgets something, she won't remember it. Her opponents are often fooled by her unassuming and blurred appearance—but this has often proved to be fatal for them once she enters in combat. Shizuku is also left-handed.\n\n__Nen Ability:__ \nDeme-chan (Blinky): Shizuku uses her nen to create a self-styled \"living\" vacuum cleaner she names \"Deme-chan\" that is able to consume any inanimate matter under her command. This has proven very useful in many occasions for cleaning up evidence that the members leave behind, especially blood and dead corpses. She also uses the razor-sharp teeth on the \"mouth\" as a weapon when in combat. Anything sucked up into her vacuum cleaner cannot be retrieved, except for the last material that was sucked in.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/5833.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 5833
      }
    },
    {
      "id": "phinks-magcub",
      "name": "Phinks Magcub",
      "alt_names": [
        "フィンクス"
      ],
      "role": "supporting",
      "description": "Phinks is a genius when it comes to unarmed combat. Phinks uses his hands in battle, which have been shown to be extremely powerful. He is rather brash and has a tendency to get into conflicts with other people. Phinks is one of the members of the Phantom Troupe that originated from Meteor City. He first appears in Egyptian Suit but later changed into jogging suit. He seems to get along with Feitan. Phinks also displays a level of compassion for Zazan's minions after they are released from her control. When they beg him to kill them he refuses to simply execute them on their knees, instead urging them to fight back and die in battle honorably. \n\n__Nen Ability:__ \nRipper Cyclotron: Phinks's nen ability involves how many times he rotates his arm. The more rotations that he does with the arm, the stronger his blow will become.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/n5834-s3A4bR8IX01p.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 5834
      }
    },
    {
      "id": "pakunoda",
      "name": "Pakunoda",
      "alt_names": [
        "パクノダ",
        "Paku",
        "Phalcnothdk"
      ],
      "role": "supporting",
      "description": "Pakunoda exudes an air of self-confidence that can be intimidating to others. She is fully loyal to Chrollo. She is one of the original Phantom Troupe from Meteor City. Her physical strength is 11th in the Troupe. \n\nShe has the ability to read the conscious thoughts of any person she is in physical contact with and can extract memories by asking specific questions. Attempting to create false information is impossible, since she can extract her target's purest memories. The information she collects is highly useful in exposing weaknesses and secrets, especially in finding out the opponent's nen ability or in situations requiring some form of extortion or blackmail. Her ability can also be used to see the recent past of an object. \n\nShe also has the ability to share her memories by shooting them into another person's head using a revolver and conjured nen bullets called \"Memory Bombs\". This is not a combat ability, and does no damage. If she shoots a Memory Bomb into the person from whom the memories were read, those memories are erased permanently.",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b5835-cbomgYG3LWrP.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 5835
      }
    },
    {
      "id": "uvogin",
      "name": "Uvogin",
      "alt_names": [
        "ウボォーギン",
        "Uvo"
      ],
      "role": "supporting",
      "description": "Uvogin is the eleventh member of the Phantom Troupe. Nobunaga has compared his personality to Gon's, seeing how not only do they have the same Nen type, but their behavior is similar as well, being impulsive and short tempered. \n\nUvogin is one of the Phantom Troupe that originated from Meteor City. However, like all of the Phantom Troupe, Uvogin doesn't hesitate to kill anyone. Out of all of the Phantom Troupe, Uvogin is the strongest in terms of physical power. Although he prefers to fight alone, Uvogin works best when fighting with a partner (specifically, Nobunaga) as he fights better when he has someone else to protect, though he would never admit it.\n\n~!Uvogin and Kurapika fought alone in the outskirt deserts of Yorknew where Kurapika eventually pierced him with his Chain of Judgement. During the final moments of the conflict Kurapika told Uvogin that if he spoke again dishonestly then he would die, but if he spoke the truth he would let him live just a little longer. He lastly orders Uvogin to reveal the location of his comrades to which Uvogin tells him to go to hell and subsequently dies due to the Judgement Chain. Uvogin's death is a significant loss to the Phantom Troupe. !~  \n\n__Nen Ability:__  \n~!Big Bang Impact: Uvogin has seasoned his nen to the point where he has 100% power in the enhancement type. He can strengthen his muscles to the point where neither bullets nor missiles will have much of an effect on him and can strengthen even his vocal cords in order to kill someone. His favorite ability is his \"Big Bang Impact\", where Uvogin focuses all of the aura to his fist with kou and lets loose, creating an impact as powerful as a bomb.!~",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/5836.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 5836
      }
    },
    {
      "id": "baka-ki-el-dogra",
      "name": "Baka Ki El Dogra",
      "alt_names": [
        "バカ キ エル・ドグラ",
        "Prince",
        "Baka-ouji"
      ],
      "role": "supporting",
      "description": "The first prince of the planet Dogura. He has an exceptionally high IQ and has little interest other than using it to torment those around him for his own amusement. His real name is Baka Ki El Dogra, but everybody refers to him solely as Prince or Prince Baka (a play with words since baka-ouji can mean both \"Prince Baka\" and \"stupid prince\").  He also appears for a few minutes in episode 36 of Hunter x Hunter (2011), commenting on an arena match. His voice actor was unlisted, however.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b6013-KlW2B29yaxwP.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 6013
      }
    },
    {
      "id": "menchi",
      "name": "Menchi",
      "alt_names": [
        "メンチ"
      ],
      "role": "supporting",
      "description": "One of the two examiners that presided over the second stage of the Exam. Her exam topic was to prepare a piece of sushi for her to taste. If it met up to her stringent expectations, the candidate would pass.",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b6088-Bih7EhJL1QE6.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 6088
      }
    },
    {
      "id": "kalluto-zoldyck",
      "name": "Kalluto Zoldyck",
      "alt_names": [
        "カルト＝ゾルディック"
      ],
      "role": "supporting",
      "description": "Kalluto Zoldyck is the younger brother of Killua. He was initially introduced accompanying his mother during Gon's retrieval of Killua from his home on Kukuroo Mountain. Kalluto appears again during the Yorknew City arc, assisting his older brother Illumi with the assassination of the ten mafia dons that placed bounties on the Phantom Troupe's heads. After the Phantom Troupe's entrance into Greed Island, Kalluto joins as Hisoka's replacement. During the Phantom Troupe's assault on Zazan's palace in Meteor City, he reveals he joined the Spiders with the intention of bringing Killua back home.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/n6089-ro8HdSKvlycB.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 6089
      }
    },
    {
      "id": "leroute",
      "name": "Leroute",
      "alt_names": [
        "レルート"
      ],
      "role": "supporting",
      "description": "Leroute is a criminal who manipulates her victims. She is smart, sharp, and insightful. Leroute was formerly a deranged psychologist who reveled in the misery of her clients. She often attacked her victims psychologically to such a degree that they often committed suicide.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/n10535-iCSNBBSq22iD.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 10535
      }
    },
    {
      "id": "neferpitou",
      "name": "Neferpitou",
      "alt_names": [
        "ネフェルピトウ",
        "Pitou"
      ],
      "role": "supporting",
      "description": "__Nen Type:__ Specialization\n\nA cat-humanoid Chimera Ant and the firstborn of the Chimera Ant King's three Royal Guards.\n\nNeferpitou is very loyal to the King, just like the rest of the Royal Guards that would sacrifice themselves for him. Neferpitou gets distracted easily, loves to play a lot and that makes them the most curious of the three Royal Guards. Hence their cat-like appearance, Pitou is a cat Chimera Ant who loves to play with their opponents like a cat would with their prey. Despite their cheerful and playful manner, Pitou has a sadistic and terrifying personality as well. \n\nUnlike Menthuthuyoupi and Shaiapouf, Neferpitou does not seem to mind much in regards to Meruem's later newfound interests with Komugi. Thus, among the three Royal Guards, Neferpitou is the only one that greatly prioritizes Komugi's safety as opposed to how Menthuthuyoupi and Shaiapouf hate Komugi, which causes tension among the guards.\n\n~!When the day of the selection finally occurs, the Extermination Team attacks the palace and causes massive damage. The King's consort, Komugi, is mortally wounded and under the King's orders, Neferpitou heals her; Neferpitou noticeably begins to sheds tears, understanding the King's sorrow and the importance of the order.\n\nThough a promise was made to go with Gon to Peijin to restore Kite, once they've reached the area, Neferpitou affirms that it is impossible and subsequently prepares to kill Gon. Gon then forcibly ages his body by sacrificing nearly all of his aura and kills Neferpitou in battle.!~",
      "metadata": {
        "gender": "non-binary",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b12300-kYzopQUTLa9A.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 12300
      }
    },
    {
      "id": "senritsu",
      "name": "Senritsu",
      "alt_names": [
        "センリツ",
        "Melody"
      ],
      "role": "supporting",
      "description": "Senritsu, known as Melody in the Viz Media translation, is a Music Hunter, named for her skill with instruments. Senritsu is a Music Hunter and is the kind and understanding member of Neon's bodyguards. She is always ready to listen to anyone's confessions and has the gift to make people open up to her. As Leorio notes, she is one of the very few characters who has made Kurapika open up to her.\n\n(Source: Wikipedia)",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b12515-Jgj0kBXgBmhf.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 12515
      }
    },
    {
      "id": "biscuit-krueger",
      "name": "Biscuit Krueger",
      "alt_names": [
        "ビスケット＝クルーガー",
        "ビスケ",
        "Bisky"
      ],
      "role": "supporting",
      "description": "Biscuit is a master and experienced teacher of Nen. She continues the Nen training Wing gave to Gon and Killua during the Greed Island arc. As a Treasure Hunter, Biscuit loves collecting rare jewels (and gets very excited about them; she has a habit of naming them) and getting money. Biscuit has a devious personality. She initially uses her cutesy appearance and demeanor to her advantage whether it's for information gathering, getting what she wants, or even in combat by acting innocent and helpless so most people will usually put their guards down around her. However, as a teacher of Nen, she has a stern and serious attitude towards her students.   \n\n~!Though in the beginning she was out to trouble Gon and Killua, at the end of the Greed Island arc she acknowledges (albeit, in her head) that she's close to developing parental feelings toward the two of them.!~ \n\n(Source: Hunterpedia)",
      "metadata": {
        "age": "57",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b13898-nHq3fRmp9uPD.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 13898
      }
    },
    {
      "id": "komugi",
      "name": "Komugi",
      "alt_names": [
        "コムギ"
      ],
      "role": "supporting",
      "description": "Komugi is a blind girl who is a genius at Gung-gi, a fictional board game of Hunter x Hunter. She is introduced during the Chimera Ant arc and frequently plays Meruem, the Chimera Ant King, in Gung-Gi games. Meruem seems to be developing some feelings towards her, despite her being a human.   ~!As of chapter 267, she is severely injured in her midsection, probably as a result of the Diving Dragons attack of Zeno, which he used when both he and Netero stormed Meruem's castle.!~ ~!After being healed by Pitou and reunited with Meruem, he informs her that he has been infected with a contagious poison and wished to spend his final moments playing against her, but warns that she should leave before long or the poison will spread to her as well. She gladly stays with Meruem and waits with him for the poison to take effect, and dies by his side.!~",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/14313-J4CtnaAZidUe.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 14313
      }
    },
    {
      "id": "isaac-netero",
      "name": "Isaac Netero",
      "alt_names": [
        "アイザック・ネテロ"
      ],
      "role": "supporting",
      "description": "__Nen type:__ Enhancement\n\nNone other than the Chairman of the Hunter Committee, and the final authority over the entirety of the Hunter Exam. He has enough administrative power to grant anyone the Hunter's license if he decides to do so, and enough combat power to playfully avoid attacks of the main heroes single-handedly when they challenge him. All examiners, even the most despotic ones, obey his orders without talking back.  He was said to be the strongest Nen user in the world 50 years ago, but he comments that he is already past his prime at his current age and that his subordinates might be stronger than him now (yet his direct subordinates disagree). Netero is also revealed to be older than Zeno Zoldyck (Killua's Grandfather), who is said to be 67 years of age. \n\nAt one point, Zeno says that when he was still a young boy, Netero was not only already old, but he is the only person alive who has fought with Maha (Zeno's) grandfather. Various stated times would put Netero over the three digit mark. He is able to use attacks faster than the speed of sound. He also uses the hyakushiki kannon which is also known as the 'Hundred Style of Buddha'. This utilizes nen to make the attacks seem as if they had come from another side and or dimension, simply because they move so fast.  In the manga he is also shown fighting chimera ants and is heading towards the destined fight with the King. His assistants Morau and Novu note that he was the strongest Nen user 50 years ago, and show great respect for his abilities.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b14489-WgGsdlQJka65.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 14489
      }
    },
    {
      "id": "neon-nostrade",
      "name": "Neon Nostrade",
      "alt_names": [
        "ネオン＝ノストラード"
      ],
      "role": "supporting",
      "description": "Neon is the daughter of the boss of the Nostrade family, who are part of the Mafia. She is a hyper but spoiled young girl, who enjoys collecting body parts (whether they are legal or not) as her hobby. She is constantly protected by many bodyguards by the order of her father.  \n\nNeon possesses a prophetic ability, which she calls \"Lovely Ghost Writer\". While she herself does not realize this, it is a form of specialization nen. Her prophecies are 100% accurate and written in the form of a poem. Neon cannot predict her own future, and is able to write a prophecy using only a small amount of information from her client. The prophecy is a automatic process, so what is written on the paper must be asked by the person in question. Neon's father was able to rise up in rank in the Mafia because of her ability. This made her father more interested in her ability then her life. This also made her father overly protected over her, assigning her many bodyguards. Kurapika is one of Neon's bodyguards.  \n\n(Source: AnimeNfo.com)",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b17564-tJHe64LxFqm1.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 17564
      }
    },
    {
      "id": "riehlvelt",
      "name": "Riehlvelt",
      "alt_names": [
        "リールベルト"
      ],
      "role": "supporting",
      "description": "He's one of the three fighters that challenge Gon and Killua on the 200th floor of Heavens Arena. Having reached the 200th floor without the use of Nen, he was \"initiated\" after being attacked with a malicious aura attack and paralyzed from the waist down. He fights with his two whips, the Twin Snake (Thunder Snakes) which also have an electric shock built-in about 1,000,000 volts of electricity.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b17720-7WEaYkPoQSB8.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 17720
      }
    },
    {
      "id": "light-nostrade",
      "name": "Light Nostrade",
      "alt_names": [
        "ライト＝ノストラード"
      ],
      "role": "supporting",
      "description": "The head of the Nostrade Mafia Family and Kurapika's temporary employer. Light usually has a calm personality but goes on edge when it's about the safety of his daughter Neon. He is very indulging on his daughter's whims.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b18108-NVyC0NCmyBnA.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 18108
      }
    },
    {
      "id": "kite",
      "name": "Kite",
      "alt_names": [
        "カイト",
        "Kaito"
      ],
      "role": "supporting",
      "description": "__Nen Type:__ Conjuration\n\nKite is the very first Hunter introduced in the story. He is a disciple of Ging Freecss, Gon's father. After saving Gon from a foxbear on Whale Island, Kite revealed to him the truth about his father. Before he took his leave, Kite left Ging's Hunter License in Gon's hands. After leaving Greed Island, Gon runs into Kite again, while he is in the middle of a zoological survey, searching for new species, in the country of Kakin. At the time, he was leading a team of young would-be Hunters.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b20594-QQJBR3LYobbv.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 20594
      }
    },
    {
      "id": "hanzou",
      "name": "Hanzou",
      "alt_names": [
        "ハンゾー",
        "半藏"
      ],
      "role": "supporting",
      "description": "An 18-year-old jounin ninja from the Cloud Hidden Village whom has trained in the art of ninjutsu from the moment he could stand. He decided to become a Hunter in order to find the elusive Hermit's Scroll.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b20677-I7bchq2Ema7S.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 20677
      }
    },
    {
      "id": "mito-freecss",
      "name": "Mito Freecss",
      "alt_names": [
        "ミト・フリークス"
      ],
      "role": "supporting",
      "description": "Mito Freecss is Gon's adopted mother, and cousin to Ging Freecss. In the manga, Mito did not want Gon to become a Hunter because Ging only came back home once after he took the Hunter's exam. She did not want Gon to leave his family like Ging did. In the manga and in the 2011 anime, Ging is Mito's cousin. However in the original anime and novelization, Mito was made into the sister of Gon's mother, making Ging her brother-in-law.",
      "metadata": {
        "gender": "female",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b20678-srslmpp3o4yK.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 20678
      }
    },
    {
      "id": "razor",
      "name": "Razor",
      "alt_names": [
        "レイザー"
      ],
      "role": "supporting",
      "description": "Razor is one of the Gamemasters and a creator of Greed Island. Razor was entrusted by Gon's father that he was not to hold back against his son should he ever comes to Greed Island. Razor is a tall and well built man by appearance and perhaps likes to play sports (especially ball games) as a pastime.Razor is a key person in getting one of the hardest designated card of the game. To get the card, the challengers must confront Razor and his 14 devils. It was learned that the 14 devils were not the pirates that follows him but his ability to emit 14 nen creatures at will. He can also emit nen into a ball (or create a ball from nen) and throw it at his opponent, which is extremely strong and could critically injure or kill his opponent on a direct hit. He was defeated in a deadly dodgeball game by Gon's allied party (consisting of Gon, Killua, Biscuit, Hisoka, and several other hunter/players hired by Battera).Razor later revealed to Gon that he was a former convict along the same as the pirates here whom were exiled to Greed Island. Razor is also the warden of these convicts. He became one of Ging's best friends and entrusted to look after the island as one of the Gamemasters.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b22518-uoFnMXlU3kAo.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 22518
      }
    },
    {
      "id": "satotz",
      "name": "Satotz",
      "alt_names": [
        "サトツ"
      ],
      "role": "supporting",
      "description": "A seemingly mouthless man, the appointed examiner for the first part of the Hunter Exam. He tests the examinees&#039; stamina by leading them on an marathon of initially unknown length through an underground tunnel. Though he seems only to move his legs at a fast walking pace, the examinees are forced to run faster and faster to keep up with his speed. After they emerge from the tunnel, Satotz then leads the examinees through the Numere Marsh, nicknamed the \"The Swindler's Nest\", a swamp filled with deadly man-eating animals, before leaving them at the site of the second exam. As an Archaeological Hunter in his normal profession, he was also inspired by Ging in taking up the Hunter license. He initially simply felt a strong civic duty to carry out his role as a judge, he progressively takes a liking to Gon and wishes to help him.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b22519-8eXaBryPSRL5.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 22519
      }
    },
    {
      "id": "wing",
      "name": "Wing",
      "alt_names": [
        "ウイング"
      ],
      "role": "supporting",
      "description": "Wing is a Nen trainer whose main student is Zushi. He meets Gon and Killua at the Celestial Tower. Although in the beginning he refuses to train Gon and Killua, and even lies to them about Nen's purpose, he changes his mind when they reach the 200th floor, as he realizes they could die or be badly injured from nen \"initiation\". For the next several months he teaches them the basics of Nen, after which he announces they have passed the secret final requirement for being a Hunter. His teacher was Biscuit Kruger.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b22521-lW31xQRGKQm8.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 22521
      }
    },
    {
      "id": "tonpa",
      "name": "Tonpa",
      "alt_names": [
        "トンパ"
      ],
      "role": "supporting",
      "description": "Examinee #16 during the Hunter exam. Tonpa is nicknamed the \"Rookie Crusher\" by other candidates with more experience taking the exam. Tonpa has taken the exam for 35 consecutive terms (given that the Hunter exam can only be taken by someone who is at least 12, it means that Tonpa either was lying, sneaked in the first two times, or that the age limit is a new rule), but has somehow never managed to pass. He often brags of his experience to those taking the Hunter Exam for the first time and then offers them a helping hand. Of course, this is merely subterfuge as he takes a perverse pleasure in sabotaging their attempts to get the license.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b22522-a0LOc6iIj2LU.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 22522
      }
    },
    {
      "id": "meruem",
      "name": "Meruem",
      "alt_names": [
        "メルエム",
        "The King (王",
        "Ō)"
      ],
      "role": "supporting",
      "description": "He was the most powerful offspring of the Chimera Ant Queen. He was known as the \"__King__\" (王, Ō) of the Chimera Ants, and served as the main antagonist of the Chimera Ant arc.\n\n~!Meruem is first seen when he violently rips through the womb of the [Chimera Ant Queen](https://anilist.co/character/83183/Chimera-Ant-Queen) from the inside, ready to emerge into the world and unwilling to wait for a natural birth. Shortly after his birth, Meruem leaves the hive and NGL with the Royal Guards, in search of a place to start his kingdom. He descends on the Republic of East Gorteau and takes over over the country by killing its dictator, Ming Jol-ik. Meruem then uses Jol-ik's corpse as a puppet to order East Gorteau's population of approximately five million to gather simultaneously in the capital city for a national rally. This however, is a ruse, designed to create a situation where entire towns and villages could be secretly abducted for a \"selection\", the forcible awakening of nen, without their disappearance being noticed.\n\nMeruem's eventual plan was to take the one percent of the population that would survive such an awakening and turn them into soldiers for an army he will use to conquer the world. This plan is temporarily disrupted by [Killua](https://anilist.co/character/27/Killua-Zoldyck), who assassinates a number of \"selectors\", but a backup plan is soon implemented; East Gorteau is put under martial law, and the population undergo selection in their own homes, though this slows down the process considerably, and only 500,000 people are processed, with 5,000 predicted survivors. Soon after this occurs, the Hunters [Netero](https://anilist.co/character/14489/Isaac-Netero), [Morel](https://anilist.co/character/29806/Morel-Mackernasey), [Knuckle](https://anilist.co/character/29809/Knuckle-Bine), [Shoot](https://anilist.co/character/29807/Shoot-McMahon), Killua, and [Gon](https://anilist.co/character/30/Gon-Freecss) attack the palace, with the intention of separating the Royal Guards from Meruem and assassinating him.\n\nMeruem's initial personality, when he his first shown in the story, is that of arrogance. The Queen's intention to give birth to a perfect offspring is reflected in Meruem's mentality. He considered himself superior to all other forms of life and felt no concern for his dying mother after his \"birth.\" Meruem was also merciless, instantly killing any chimera ant he considered disrespectful. Meruem was seen killing and eating other chimera ants, something no other chimera ant had ever done.\n\nAfter reaching East Gorteau and putting his plans into motion, Meruem took an interest in various board games, and gathered various champion-level players to his palace. Simply by reading the rule books, Meruem was able to master any game in under ten matches, simultaneously learning from his opponents while disrupting the \"flow\" of their play style. After defeating the best player for each game, Meruem proceeded to kill them, as they were of no further use to him.\n\nThe final game Meruem learns is Gungi, a fictional shogi-like board game invented by East Gorteau. The world champion for the game is Komugi, a seemingly dimwitted blind girl; However, as Meruem played against her, he found himself unable to disrupt her flow, while at the same time, the challenge of playing against Meruem caused [Komugi](https://anilist.co/character/14313/Komugi)'s skills to increase. Much to the shock of the Royal Guards, Meruem even starts show respect for Komugi and concern for Komugi's well being. In one instance Meruem rips his left arm off, as an apology to Komugi for asking her to bet her left arm on a game, to which she replied that she always bet her life. In another instance, after watching Komugi's nen suddenly awaken, and realizing she would grow exponentially stronger, but only in terms of Gungi, Meruem momentarily decides that his power of \"violence\" was the strongest type of strength, and ultimately Komugi's abilities are meaningless; Yet, moments after this decision, Meruem finds Komugi under attack by a large bird of prey, and is unable to bring himself to do anything except protect her, ultimately unable to understand his own emotions toward Komugi. This leaves Meruem in a contemplative state, wondering about the purpose for his existence in the world.\n\nAs of chapter 290 of the manga, Meruem is preparing to battle Netero, who attacked his castle in order to assassinate him. Before the battle, Komugi is gravely injured by a nen ability meant to cause confusion within the palace, and Meruem orders [Neferpitou](https://anilist.co/character/12300/Neferpitou) to save her life. The way Meruem is drawn in this scene suggests he has learned what it means to have concern for someone else's well being.\n\nHe and Netero then travel to a remote location that was once used for military weapons testing, so that they may both go all out in their fight. However, in a surprising twist, Meruem refuses to fight the Hunter. Through a short conversation between the two, the King reveals that he finally realizes that he should use his power to protect the weak, seeing from Komugi that there are humans who deserve to live; Netero counted among them. He also expresses a desire to remake the world so that everyone is so equal, the term \"equality\" would become obsolete. Netero realizes that Meruem is dangerously caught between his Ant instincts and his humanity, and at this point, either facet of his psyche could win out. Knowing that he has a mission to carry out regardless, and not wanting his heart to waver, Netero suddenly assaults Meruem first with a devastating attack.\n\nMeruem possesses a nen ability that allows him to absorb the raw aura of nen-users he has killed. By devouring their brain, he adds their aura to his own--further increasing his power. His fighting ability is such that even Netero, chairman of the Hunter committee, expresses doubt that he could defeat him.!~\n\n(Source: Wikipedia)",
      "metadata": {
        "gender": "male",
        "age": "40 Days",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b23277-EYmIxzL64Mji.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 23277
      }
    },
    {
      "id": "ponzu",
      "name": "Ponzu",
      "alt_names": [
        "ポンズ"
      ],
      "role": "supporting",
      "description": "Examinee #246 during the Hunter Exam. Ponzu is the only prominent female who managed to enter the last few stages of the Hunter exam. Her secret weapon lies in the big round hat she wears, which carries powerful bees under the surface that emerge and attack people that threaten her. Although Ponzu is a relatively minor character in the series, her cute and girlish charm has won her some fans who voted for her in an early Hunter popularity poll. \n\n~!During the fourth stage of the Hunter exam her bees kill Barbon when she falls into his trap. She is rescued by Gon, Leorio, and Kurapika, but her tag is taken by Leorio when she is unconscious, and she is therefore not able to continue to the last stage of the Exam.!~   \n\n~!In Chimera Ant arc after Pokkle was knocked out, she immediately runs for it. Knowing that Pokkle won't be eaten immediately, she rushed to write SOS messages in blood and uses her bees to bring the message to the strongest Hunter nearby. When she finally decided to go back to the border, she is shot and eaten moments later by an officer from Zazan's squad.!~",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b24279-wCttqcLJ3W2b.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 24279
      }
    },
    {
      "id": "ikalgo",
      "name": "Ikalgo",
      "alt_names": [
        "イカルゴ"
      ],
      "role": "supporting",
      "description": "__Nen Type:__ Manipulation\n\nIkalgo  is a former officer of the chimera ants whom eventually befriends Killua. Ikalgo, an octopus, wishes he had been a squid instead. After saving Killua&#039;s life after a battle, Ikalgo teams up with him in the assault on the palace of East Gorteau.\n\n## __Ikalgo's Abilities:__\n\n~! __Fleadom__ (蚤弾フリーダム Bullets of Flea)\n_Type: Conjuration_\nFleadom allows Ikalgo to turn two of his tentacles into an air rifle. When residing inside a corpse, Ikalgo can use a special kind of giant fleas as rounds for the gun; they have a vertical leap of 200 meters (approx. 656 ft 2 in), and their saliva contains anticoagulant properties so potent that not even Killua was immune to it. The flea bullets boast impressive range and muzzle velocity and are powerful enough to knock an unaware individual back a few meters. Furthermore, their trajectory did not appear to change in the slightest when Ikalgo was targeting Killua. However, they do not appear to be capable of killing the target directly, managing to draw blood but not proving lethal even when hitting a critical area such as the neck. This would be in line with Ikalgo's reluctance to kill. The fleas can be conjured only if Ikalgo is puppeteering a corpse; if he is not, he can conjure regular bullets. The air gun needs to be recharged after every shot. By pulling the trigger with an empty chamber, Ikalgo can utilize the stored air to propel himself backwards at high speed.\n\n__Living Dead Dolls__ (死体と遊ぶな子供たちリビングデッドドールズ)\n_Type:  Manipulation_\nIkalgo is capable of inhabiting and taking control of a corpse, manipulating its movements, and utilizing its voice and Nen abilities. When he does so, he seems to reside in the head of the host, but can apparently leave its body from other points. Although Ikalgo can manipulate a corpse, he is powerless to stop its decomposition.!~",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/29805-YicEgIbxmSkv.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 29805
      }
    },
    {
      "id": "morel-mackernasey",
      "name": "Morel Mackernasey",
      "alt_names": [
        "モラウ=マッカーナーシ"
      ],
      "role": "supporting",
      "description": "__Nen Type:__ Manipulation\n\nMorel is a Hunter who uses a giant smoking pipe and smoke as weapons, and who has a great sense of compassion. As his role progresses during the chimera ant arc, Morel shows himself as an experienced and resourceful fighter, which is shown in his fight against Leol wherein he uses his pipe as a snorkel so that he could allow himself to breathe underwater, and in doing so suffocates his opponent with the Carbon Dioxide he had emitted. The smoke that he uses are for his nen ability, able to take on various shapes and could act independently to him once commands are issued.\n\n##  __Morel's Abilities:__\n\n~! __Deep Purple__ (紫煙機兵隊ディープパープル Purple Haze Soldiers)\n_Type: Emission, Manipulation, and Transmutation_\nThis ability allows Morel to transmute his aura into smoke and to manipulate it in any way he sees fit. With the aid of his giant pipe, he produces great amounts of smoke which he can then shape in countless constructs, such as ropes, grass, hoses, rafts, rabbits, dolls, and even replicas of individuals fully capable of speech and with remarkable strength and speed, although physical contact with them will expose the trick. Smoke constructs can also be told apart from living beings with En, although not with general aura sensing. Morel can change the color of the smoke to make the created objects seem more realistic, even using them to blend into his surroundings, as well as modify their durability to the point they can become virtually indestructible. The versatility of Deep Purple is such that Morel boasted he had yet to meet a Nen user with a more flexible ability.\n\nHis most complex creations are the Smoke Troopers. Morel can emit cores wherein he puts simple Manipulation commands, such as to attack defensively and retreat when encountered by an enemy, before covering the cores with smoke and mold them into his Troopers, which then start acting automatically. It is possible that the cores are not always required, as Morel was able to create Troopers directly from his exhaled smoke. In this case they seem to operate by taking direct orders from Morel rather than relying on preset commands. Alternatively, it is possible that Morel can form the cores remotely, at the same time as he shapes the smoke into constructs. Morel can create a maximum of 216 dolls. By sacrificing quantity to gain quality, he can compress that amount to 50. These dolls then become more complex than his regular dolls, and Neferpitou admitted their quality was superior to the one they controlled. Deep Purple caps Morel's aura output. Dispelling the constructs enables Morel to retrieve the aura he poured into them and utilize it again.\n\n__Smoky Jail__ (監獄ロックスモーキージェイル)\n_Type: Manipulation and Transmutation_\nMorel encases himself and the opponent in an impenetrable barrier made out of smoke. The barrier appears to be unbreakable both from the inside and the outside, as Menthuthuyoupi was unable to damage it with his regular attacks as well as his explosions. Only particle-sized bodies can cross it. Since the smoky aura is detached from his body, Emission might also be involved in the ability.!~",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b29806-49vvaQbvx7Ag.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 29806
      }
    },
    {
      "id": "shoot-mcmahon",
      "name": "Shoot McMahon",
      "alt_names": [
        "シュート＝マクマホン"
      ],
      "role": "supporting",
      "description": "Shoot McMahon (シュート＝マクマホン, Shūto Makumahon?) is an Unidentified Beast Hunter, Knuckle's partner, and the second disciple of Morel. He has a timid personality and is often afraid of taking advantage of opportune times to attack his enemy. When the fight begins with Youpi, he becomes inspired by Gon and is able to fully unleash his power, overcoming his timidness and injuries.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/29807.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 29807
      }
    },
    {
      "id": "meleoron",
      "name": "Meleoron",
      "alt_names": [
        "メレオロン",
        "Jail"
      ],
      "role": "supporting",
      "description": "A chameleon-like ant, Meleoron is an eccentric among chimera ants, as he dislikes fighting or killing. Even though Meleoron has the rank of a squadron leader, he himself admits his actual fighting strength is only on par with a common soldier ant. Meleoron dresses in a hooded sweatshirt with sweatpants, and is often seen smoking. His original name, before the chimera ant queen died, was Jail.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/29808.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 29808
      }
    },
    {
      "id": "knuckle-bine",
      "name": "Knuckle Bine",
      "alt_names": [
        "ナックル゠バイン"
      ],
      "role": "supporting",
      "description": "__Nen Type:__ Conjuration\n\nKnuckle Bine is an Unidentified Beast Hunter and Morel's apprentice. Despite appearing to be an aggressive man, Knuckle is very compassionate and easily moved to tears. Knuckle also gets along well with animals, having the habit of taking care of abandoned pets.\n\n __Knuckle's Abilities:__\n\n~! __Hakoware__ (天上不知唯我独損)\n_Type: Emission and Manipulation_\nHakoware involves Knuckle emitting an indestructible mascot called the \"Amortizing Power Redirector (A.P.R.)\" (\"Potclean\"; ポットクリン, Pottokurin, in Japanese) onto the opponent after being dealt a blow from Knuckle. A.P.R. constantly lends Knuckle's aura to whomever it is attached to, displayed by a rising counter on its forehead. When adding interest, A.P.R. announces \"It's time, adding interest\" (「時間です。利息が付きます」, Jikan desu, risoku ga tsukimasu). As long as A.P.R. is attached, any attacks done to Knuckle by his opponent return aura to him, lowering the counter. Until all of the aura lent by Knuckle is returned to him, he cannot be physically damaged by his opponent. The reverse is also true: each of Knuckle's blows only lends more aura to his opponent, causing no damage. The stronger the attack, the more aura is lent or returned. In both cases, the person suffering the blow can still be knocked back by it, despite suffering no damage.\n\nThe interest rate on A.P.R. is 10% of the borrowed aura, accrued every 10 seconds while the victim is within 50 meters of Knuckle. As the amount of borrowed aura (including interest) accumulates, A.P.R. also grows in size. When the aura borrowed from Knuckle exceeds his opponent's total remaining aura (specifically P.O.P), the opponent \"goes bankrupt\". Thus, it is in Knuckle's interest that his opponent spends/wastes as much aura as possible, as quickly as possible (so long as said aura is not spent on Knuckle himself). The result is that the opponent's \"aura balance\" falls that much quicker until it is below the amount they owe Knuckle (displayed by A.P.R), at which point they can no longer possibly repay their debt and bankruptcy sets in.\n\nBankruptcy causes A.P.R. to transform into the \"Individual Ren Suppressor (I.R.S.)\" (トリタテン, \"Toritaten\"), a demon-like mascot that follows the debtor for 30 days and forces them into a continuous state of Zetsu. It is worth noting that when Knuckle struck Shaiapouf's copy, A.P.R. was attached to the latter's real body rather than to his clone. Furthermore, Knuckle can use Hakoware on multiple targets at once, as well as track their general location at all times, regardless of the distance. The ability can be removed by an Exorcist, but it takes a great deal out of the Nen remover. It is also cancelled if Knuckle is rendered unconscious.\n\nIt is unclear what Nen types are involved in the ability; A.P.R. (and later Toritaten) might be conjured and rendered invisible to non-users, which would increase the aura cost, or emitted and possibly transmuted. Regardless, Manipulation would likely be required to endow the construct with sentience (and possibly to enforce Zetsu on the target), while Emission might be involved in the process of lending aura to the opponent.!~",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/b29809-wAoam5TkZilJ.png",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 29809
      }
    },
    {
      "id": "barry",
      "name": "Barry",
      "alt_names": [
        "バリー"
      ],
      "role": "supporting",
      "description": "Hired by Battera, working in Tsezguerra's group, he joins Gon and the others in their battle against Razor for the Tsubo of the Coast. He's the first one to battle in boxing.  He defeats his opponent without using Hatsu.",
      "metadata": {
        "gender": "male",
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/33283.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 33283
      }
    },
    {
      "id": "tsezguerra",
      "name": "Tsezguerra",
      "alt_names": [
        "ツェズゲラ"
      ],
      "role": "supporting",
      "description": "Tsezguerra is an experienced Money Hunter and 1-Star Hunter. He is hired by Battera to beat Greed Island and also tests the people who want to enter Greed Island in order to earn the 50 Billion prize money. He and his team ally with Gon, Killua, Biscuit, Hisoka and Goreinu to take part in the dodgeball game against Razor. He and his team later engage Genthru's in a game of chase in order to buy time for Gon to train against Genthru's \"Little Flower\" ability and for Killua to heal his injuries.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/33285.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 33285
      }
    },
    {
      "id": "goreinu",
      "name": "Goreinu",
      "alt_names": [
        "ゴレイヌ"
      ],
      "role": "supporting",
      "description": "A Greed Island player, he battles Razor along with Gon, Bisuke en Killua both times. He ends up giving Gon the cards he needs to win the game.  His nen ability is the power to summon two gorillas made of nen. His white gorilla, White Goreinu, is able to change places with Goreinu. His black gorilla, Black Goreinu, is able to switch places with other people.",
      "metadata": {
        "dateOfBirth": null
      },
      "images": [
        {
          "url": "https://s4.anilist.co/file/anilistcdn/character/large/33299.jpg",
          "type": "portrait",
          "source": "AniList"
        }
      ],
      "external_ids": {
        "anilist": 33299
      }
    }
  ],
  "updated_at": "2025-12-22T21:11:13.464Z"
}